Solderingironspb/STM32F103C8T6_CMSIS_notes/CMSIS_SPI_Slave/Core/Src/stm32f103xx_CMSIS.c
/**
 ******************************************************************************
 *  @file stm32f103xx_CMSIS.c
 *  @brief CMSIS на примере МК STM32F103C8T6
 *  @author Волков Олег
 *  @date 17.07.2022
 *
  ******************************************************************************
 * @attention
 *
 *  Библиотека помогает разобраться с библиотекой CMSIS на примере
 *  МК STM32F103C8T6
 *
 *  YouTube: https://www.youtube.com/channel/UCzZKTNVpcMSALU57G1THoVw
 *  GitHub: https://github.com/Solderingironspb/Lessons-Stm32/blob/master/README.md
 *  Группа ВК: https://vk.com/solderingiron.stm32
 *  Работал по Reference Manual: https://www.st.com/resource/en/reference_manual/cd00171190-stm32f101xx-stm32f102xx-stm32f103xx-stm32f105xx-and-stm32f107xx-advanced-arm-based-32-bit-mcus-stmicroelectronics.pdf
 *
 ******************************************************************************
 */

#include "stm32f103xx_CMSIS.h"

 /*================================= НАСТРОЙКА DEBUG ============================================*/

 /**
 ***************************************************************************************
 *  @breif Debug port mapping
 *  Reference Manual/см. п.9.3.5 JTAG/SWD alternate function remapping (стр. 177)
 *  Наверное это нужно настраивать в самом начале, еще до тактирования...
 ***************************************************************************************
 */

void CMSIS_Debug_init(void) {
	/**
	*  Alternate function GPIO port
	*  JTMS / SWDIO PA13
	*  JTCK / SWCLK PA14
	*  JTDI PA15
	*  JTDO / TRACESWO PB3
	*  NJTRST PB4
	*/
	SET_BIT(RCC->APB2ENR, RCC_APB2ENR_IOPAEN); //Включим тактирование порта A
	SET_BIT(RCC->APB2ENR, RCC_APB2ENR_AFIOEN); //Включим тактирование альтернативных функций

	/**
	 *  Выберем режим отладки см.п 9.4.2 AF remap and debug I/O configuration register (AFIO_MAPR)(стр 184)
	 */

	 /**
	 *  Bits 26:24 SWJ_CFG[2:0]: Serial wire JTAG configuration
	 *  These bits are write-only (when read, the value is undefined). They are used to configure the
	 *  SWJ and trace alternate function I/Os. The SWJ (Serial Wire JTAG) supports JTAG or SWD
	 *  access to the Cortex® debug port. The default state after reset is SWJ ON without trace.
	 *  This allows JTAG or SW mode to be enabled by sending a specific sequence on the JTMS / JTCK pin.
	 *  000: Full SWJ (JTAG-DP + SW-DP): Reset State          (JTAG 5 pins ) по-умолчанию
	 *  001: Full SWJ (JTAG-DP + SW-DP) but without NJTRST    (JTAG 4 pins)
	 *  010: JTAG-DP Disabled and SW-DP Enabled               (Serial wire)
	 *  100: JTAG-DP Disabled and SW-DP Disabled              (No Debug)
	 *  Other combinations: no effect
	 */

	MODIFY_REG(AFIO->MAPR, AFIO_MAPR_SWJ_CFG, 0b010 << AFIO_MAPR_SWJ_CFG_Pos); //Serial wire

	/**
	*  При выборе Serial wire:
	*  PA13 /JTMS/SWDIO
	*  PA14 /JTCK/SWCLK.
	*  PA15, PB3 и PB4 свободны
	*/
	/*Заблокируем доступ для редактирования конфигурации PA13 и PA14*/
	GPIOA->LCKR = GPIO_LCKR_LCKK | GPIO_LCKR_LCK13 | GPIO_LCKR_LCK14;
	GPIOA->LCKR = GPIO_LCKR_LCK13 | GPIO_LCKR_LCK14;
	GPIOA->LCKR = GPIO_LCKR_LCKK | GPIO_LCKR_LCK13 | GPIO_LCKR_LCK14;
	GPIOA->LCKR;
}


/*============================== НАСТРОЙКА RCC =======================================*/
/**
 ***************************************************************************************
 *  @breif Настройка МК STM32F103C8T6 на частоту 72MHz от внешнего кварцевого резонатора
 *  Внешний кварцевый резонатор на 8 MHz
 *  ADC настроен на 12MHz
 *  USB настроен на 48MHz
 *  MCO подключен к PLL и тактируется от 36MHz
 *  Reference Manual/см. п.7.3 RCC registers (стр. 99)
 *  В настройке также необходимо настроить FLASH на работу, совместимую с 72MHz:
 *  Reference Manual/см. п.3.2 Memory organization (стр. 49)
 ***************************************************************************************
 */

void CMSIS_RCC_SystemClock_72MHz(void) {

	/* Начнем с п. 7.3.1 Clock control register (RCC_CR)*/

	/**
	*  Bit 0 HSION : Internal high - speed clock enable
	*  Set and cleared by software.
	*  Set by hardware to force the internal 8 MHz RC oscillator ON when leaving Stop or Standby
	*  mode or in case of failure of the external 4 - 16 MHz oscillator used directly or indirectly as
	*  system clock.This bit cannot be reset if the internal 8 MHz RC is used directly or indirectly
	*  as system clock or is selected to become the system clock.
	*  0 : internal 8 MHz RC oscillator OFF
	*  1 : internal 8 MHz RC oscillator ON
	*/

	SET_BIT(RCC->CR, RCC_CR_HSION); //Запустим внутренний RC генератор на 8 МГц

	/**
	*  Bit 1 HSIRDY : Internal high - speed clock ready flag
	*  Set by hardware to indicate that internal 8 MHz RC oscillator is stable.After the HSION bit is
	*  cleared, HSIRDY goes low after 6 internal 8 MHz RC oscillator clock cycles.
	*  0 : internal 8 MHz RC oscillator not ready
	*  1 : internal 8 MHz RC oscillator ready
	*/

	while (READ_BIT(RCC->CR, RCC_CR_HSIRDY) == 0); //Дождемся поднятия флага о готовности

	/**
	*  Bit 2 Reserved, must be kept at reset value.
	*/

	/**
	*  Bits 7:3 HSITRIM[4:0]: Internal high-speed clock trimming
	*  These bits provide an additional user-programmable trimming value that is added to the
	*  HSICAL[7:0] bits. It can be programmed to adjust to variations in voltage and temperature
	*  that influence the frequency of the internal HSI RC.
	*  The default value is 16, which, when added to the HSICAL value, should trim the HSI to 8
	*  MHz ± 1%. The trimming step (Fhsitrim) is around 40 kHz between two consecutive HSICAL steps.
	*/
	//Тут оставим по-умолчанию

	/**
	*  Bits 15:8 HSICAL[7:0]: Internal high-speed clock calibration
	*  These bits are initialized automatically at startup.
	*/
	//Тут тоже пусть будет все по-умолчанию

	//Далее чуть-чуть поменяем порядок выполнения команд, т.к. 18 бит должен быть определен до включения HSE(16-17 бит).

	/**
	*  Bit 18 HSEBYP: External high-speed clock bypass
	*  Set and cleared by software to bypass the oscillator with an external clock. The external
	*  clock must be enabled with the HSEON bit set, to be used by the device. The HSEBYP bit
	*  can be written only if the HSE oscillator is disabled.
	*  0: external 4-16 MHz oscillator not bypassed
	*  1: external 4-16 MHz oscillator bypassed with external clock
	*/

	CLEAR_BIT(RCC->CR, RCC_CR_HSEBYP); //Просто сбросим этот бит в 0(Хотя изначально он и так должен быть в 0).

	/**
	*  Bit 16 HSEON: HSE clock enable
	*  Set and cleared by software.
	*  Cleared by hardware to stop the HSE oscillator when entering Stop or Standby mode. This
	*  bit cannot be reset if the HSE oscillator is used directly or indirectly as the system clock.
	*  0: HSE oscillator OFF
	*  1: HSE oscillator ON
	*/

	SET_BIT(RCC->CR, RCC_CR_HSEON); //Запустим внешний кварцевый резонатор. Он у нас на 8 MHz.

	/**
	*  Bit 17 HSERDY: External high-speed clock ready flag
	*  Set by hardware to indicate that the HSE oscillator is stable. This bit needs 6 cycles of the
	*  HSE oscillator clock to fall down after HSEON reset.
	*  0: HSE oscillator not ready
	*  1: HSE oscillator ready
	*/

