Solderingironspb/STM32F103C8T6_CMSIS_notes/CMSIS_SPI_Slave/Core/Src/stm32f103xx_CMSIS.c
	while (READ_BIT(RCC->CR, RCC_CR_HSERDY) == 0); //Дождемся поднятия флага о готовности

	/**
	*  Bit 19 CSSON: Clock security system enable
	*  Set and cleared by software to enable the clock security system. When CSSON is set, the
	*  clock detector is enabled by hardware when the HSE oscillator is ready, and disabled by
	*  hardware if a HSE clock failure is detected.
	*  0: Clock detector OFF
	*  1: Clock detector ON (Clock detector ON if the HSE oscillator is ready , OFF if not).
	*/

	SET_BIT(RCC->CR, RCC_CR_CSSON); //Включим CSS

	/**
	*  Bits 23 : 20 Reserved, must be kept at reset value.
	*/


	/**
	*  Bit 24 PLLON: PLL enable
	*  Set and cleared by software to enable PLL.
	*  Cleared by hardware when entering Stop or Standby mode. This bit can not be reset if the
	*  PLL clock is used as system clock or is selected to become the system clock.
	*  0: PLL OFF
	*  1: PLL ON
	*/

	//SET_BIT(RCC->CR, RCC_CR_PLLON); //Запустим PLL, но чуточку позже, т.к. перед его включением нужно настроить другие регистры, иначе придется вкл/выкл постоянно.

	/**
	*  Bit 25 PLLRDY: PLL clock ready flag
	*  Set by hardware to indicate that the PLL is locked.
	*  0: PLL unlocked
	*  1: PLL locked
	*/

	//while (READ_BIT(RCC->CR, RCC_CR_PLLRDY) == 0) ; //Тут мы должны дожидаться поднятия флага включения PLL

	/**
	*  Bits 31:26 Reserved, must be kept at reset value.
	*/

	// Переходим к следующему пункту 7.3.2 Clock configuration register (RCC_CFGR)
	//Не забываем, что PPL мы пока не включали, чтоб сделать настройки далее.

	/**
	*  Bits 1:0 SW: System clock switch
	*  Set and cleared by software to select SYSCLK source.
	*  Set by hardware to force HSI selection when leaving Stop and Standby mode or in case of
	*  failure of the HSE oscillator used directly or indirectly as system clock (if the Clock Security System is enabled).
	*  00: HSI selected as system clock
	*  01: HSE selected as system clock
	*  10: PLL selected as system clock
	*  11: not allowed
	*/

	MODIFY_REG(RCC->CFGR, RCC_CFGR_SW, RCC_CFGR_SW_HSE); //Выберем HSE в качестве System Clock(PLL лучше пока не выбирать, он у нас отключен)
	//p.s. Спасибо KARMA Electronics за подсказку.

	/**
	*  Bits 3:2 SWS: System clock switch status
	*  Set and cleared by hardware to indicate which clock source is used as system clock.
	*  00: HSI oscillator used as system clock
	*  01: HSE oscillator used as system clock
	*  10: PLL used as system clock
	*  11: not applicable
	*/

	//Это статус

	/**
	*  Bits 7:4 HPRE: AHB prescaler
	*  Set and cleared by software to control the division factor of the AHB clock.
	*  0xxx: SYSCLK not divided
	*  1000: SYSCLK divided by 2
	*  1001: SYSCLK divided by 4
	*  1010: SYSCLK divided by 8
	*  1011: SYSCLK divided by 16
	*  1100: SYSCLK divided by 64
	*  1101: SYSCLK divided by 128
	*  1110: SYSCLK divided by 256
	*  1111: SYSCLK divided by 512
	*  Note: The prefetch buffer must be kept on when using a prescaler different from 1 on the
	*  AHB clock. Refer to Reading the Flash memory section for more details.
	*/
	MODIFY_REG(RCC->CFGR, RCC_CFGR_HPRE, RCC_CFGR_HPRE_DIV1); //APB Prescaler /1
	//Вот тут в Note пишется отсылка к Flash(см. стр. 58)

	//Поэтому прервемся и настроим Flash (Flash access control register (FLASH_ACR))

	/**
	*  Bits 2:0 LATENCY: Latency
	*  These bits represent the ratio of the SYSCLK (system clock) period to the Flash access time.
	*  000 Zero wait state, if 0 < SYSCLK <= 24 MHz
	*  001 One wait state, if 24 MHz < SYSCLK <= 48 MHz
	*  010 Two wait states, if 48 MHz < SYSCLK <= 72 MHz
	*/

	MODIFY_REG(FLASH->ACR, FLASH_ACR_LATENCY, 0b010 << FLASH_ACR_LATENCY_Pos); //010 Two wait states, if 48 MHz < SYSCLK <= 72 MHz

	/**
	*  Bit 3 HLFCYA: Flash half cycle access enable
	*  0: Half cycle is disabled
	*  1: Half cycle is enabled
	*/
	//Тут я пока не понял, поэтому не трогал

	/**
	*  Bit 4 PRFTBE: Prefetch buffer enable
	*  0: Prefetch is disabled
	*  1: Prefetch is enabled
	*/

	SET_BIT(FLASH->ACR, FLASH_ACR_PRFTBE); //Prefetch is enabled

	/**
	*  Bit 5 PRFTBS: Prefetch buffer status
	*  This bit provides the status of the prefetch buffer.
	*  0: Prefetch buffer is disabled
	*  1: Prefetch buffer is enabled
	*/


	/**
	*  Bits 31:6 Reserved, must be kept at reset value
	*/

	// Вот теперь можно вернуться обратно к пункту 7.3.2 Clock configuration register (RCC_CFGR) стр.103

	/**
	*  Bits 10:8 PPRE1: APB low-speed prescaler (APB1)
	*  Set and cleared by software to control the division factor of the APB low-speed clock (PCLK1).
	*  Warning: the software has to set correctly these bits to not exceed 36 MHz on this domain.
	*  0xx: HCLK not divided
	*  100: HCLK divided by 2
	*  101: HCLK divided by 4
	*  110: HCLK divided by 8
	*  111: HCLK divided by 16
	*/
	MODIFY_REG(RCC->CFGR, RCC_CFGR_PPRE1, RCC_CFGR_PPRE1_DIV2); //APB1 Prescaler /2, т.к. PCLK1 max 36MHz

	/**
	*  Bits 13:11 PPRE2: APB high-speed prescaler (APB2)
	*  Set and cleared by software to control the division factor of the APB high-speed clock (PCLK2).
	*  0xx: HCLK not divided
	*  100: HCLK divided by 2
	*  101: HCLK divided by 4
	*  110: HCLK divided by 8
	*  111: HCLK divided by 16
	*/

	MODIFY_REG(RCC->CFGR, RCC_CFGR_PPRE2, RCC_CFGR_PPRE2_DIV1); //APB2 Prescaler /1. Тут нас ничего не ограничивает. Будет 72MHz.

	/**
	*  Bits 15:14 ADCPRE: ADC prescaler
	*  Set and cleared by software to select the frequency of the clock to the ADCs.
	*  00: PCLK2 divided by 2
	*  01: PCLK2 divided by 4
	*  10: PCLK2 divided by 6
	*  11: PCLK2 divided by 8
	*/

	MODIFY_REG(RCC->CFGR, RCC_CFGR_ADCPRE, RCC_CFGR_ADCPRE_DIV6); //ADC Prescaler /6, чтоб было 12MHz, т.к. максимальная частота тут 14 MHz

	/**
	*  Bit 16 PLLSRC: PLL entry clock source
	*  Set and cleared by software to select PLL clock source. This bit can be written only when PLL is disabled.
	*  0: HSI oscillator clock / 2 selected as PLL input clock
	*  1: HSE oscillator clock selected as PLL input clock
	*/

	SET_BIT(RCC->CFGR, RCC_CFGR_PLLSRC); //В качестве входного сигнала для PLL выберем HSE

	/**
	*  Bit 17 PLLXTPRE: HSE divider for PLL entry
	*  Set and cleared by software to divide HSE before PLL entry. This bit can be written only when PLL is disabled.
	*  0: HSE clock not divided
	*  1: HSE clock divided by 2
	*/

