Solderingironspb/STM32F103C8T6_CMSIS_notes/CMSIS_SPI_Slave/Core/Src/stm32f103xx_CMSIS.c
	CLEAR_BIT(RCC->CFGR, RCC_CFGR_PLLXTPRE_HSE); //Никакое предделение перед PLL нам не нужно. Поэтому /1.

	/**
	*  Bits 21:18 PLLMUL: PLL multiplication factor
	*  These bits are written by software to define the PLL multiplication factor. These bits can be
	*  written only when PLL is disabled.
	*  Caution: The PLL output frequency must not exceed 72 MHz.
	*  0000: PLL input clock x 2
	*  0001: PLL input clock x 3
	*  0010: PLL input clock x 4
	*  0011: PLL input clock x 5
	*  0100: PLL input clock x 6
	*  0101: PLL input clock x 7
	*  0110: PLL input clock x 8
	*  0111: PLL input clock x 9
	*  1000: PLL input clock x 10
	*  1001: PLL input clock x 11
	*  1010: PLL input clock x 12
	*  1011: PLL input clock x 13
	*  1100: PLL input clock x 14
	*  1101: PLL input clock x 15
	*  1110: PLL input clock x 16
	*  1111: PLL input clock x 16
	*/

	MODIFY_REG(RCC->CFGR, RCC_CFGR_PLLMULL, RCC_CFGR_PLLMULL9); //т.к. кварц у нас 8Mhz, а нам нужно 72MHz, то в PLL нужно сделать умножение на 9. 8MHz * 9 = 72MHz.

	/**
	*  Bit 22 USBPRE: USB prescaler
	*  Set and cleared by software to generate 48 MHz USB clock. This bit must be valid before
	*  enabling the USB clock in the RCC_APB1ENR register. This bit can’t be reset if the USB clock is enabled.
	*  0: PLL clock is divided by 1.5
	*  1: PLL clock is not divided
	*/

	CLEAR_BIT(RCC->CFGR, RCC_CFGR_USBPRE); //Для USB 72MHz/1.5 = 48MHz

	/**
	*  Bits 26:24 MCO: Microcontroller clock output
	*  Set and cleared by software.
	*  0xx: No clock
	*  100: System clock (SYSCLK) selected
	*  101: HSI clock selected
	*  110: HSE clock selected
	*  111: PLL clock divided by 2 selected
	*  Note: This clock output may have some truncated cycles at startup or during MCO clock source switching.
	*  When the System Clock is selected to output to the MCO pin, make sure that this clock does not exceed 50 MHz (the maximum IO speed).
	*/

	MODIFY_REG(RCC->CFGR, RCC_CFGR_MCO, RCC_CFGR_MCO_PLLCLK_DIV2); //В качестве тактирования для MCO выбрал PLL. Будет 36 MHz.
	//Чтоб воспользоваться выводом MCO, нужно настроить ножку PA8 в альтернативную функцию на выход.

	/**
	*  Bits 31:27 Reserved, must be kept at reset value.
	*/

	//И наконец, после всех настроек, мы можем запустить PLL

	/**
	*  Bit 24 PLLON: PLL enable
	*  Set and cleared by software to enable PLL.
	*  Cleared by hardware when entering Stop or Standby mode. This bit can not be reset if the
	*  PLL clock is used as system clock or is selected to become the system clock.
	*  0: PLL OFF
	*  1: PLL ON
	*/

	SET_BIT(RCC->CR, RCC_CR_PLLON); //Запустим PLL

	//Т.к. PLL уже запущен, выберем его в качестве System Clock:
	MODIFY_REG(RCC->CFGR, RCC_CFGR_SW, RCC_CFGR_SW_PLL); //Выберем PLL в качестве System Clock

	/**
	*  Bit 25 PLLRDY: PLL clock ready flag
	*  Set by hardware to indicate that the PLL is locked.
	*  0: PLL unlocked
	*  1: PLL locked
	*/

	while (READ_BIT(RCC->CR, RCC_CR_PLLRDY) == 0); //Дожидемся поднятия флага включения PLL

	//В итоге должно получится:
	//RCC->CR == 0x030B5A83
	//RCC->CFGR == 0x071D840A
	//К сожалению, нельзя просто так взять и сразу применить значения регистров и настроить все в 2 строчки кода, т.к. порядок выполнения команд играет очень большую роль.
}
/*========================= НАСТРОЙКА СИСТЕМНОГО ТАЙМЕРА ==============================*/

/**
*  P.S. С Системным таймером очень долго не мог понять, где брать информацию, т.к. в Reference Manual по нему ничего нет, а оказалось, что нужно
*  было открыть документацию на МК (PM0056 STM32F10xxx/20xxx/21xxx/L1xxxx Cortex®-M3 programming manual)
*  Ссылка: https://www.st.com/resource/en/programming_manual/pm0056-stm32f10xxx20xxx21xxxl1xxxx-cortexm3-programming-manual-stmicroelectronics.pdf
*  Ищем п. 4.5 SysTick timer (STK) (стр. 150), где все хорошо и доходчиво пояснено
*/

/*The processor has a 24 - bit system timer, SysTick, that counts down from the reload value to
zero, reloads(wraps to) the value in the LOAD register on the next clock edge, then counts
down on subsequent clocks.
When the processor is halted for debugging the counter does not decrement.*/


/**
 ***************************************************************************************
 *  @breif Настройка SysTick на микросекунды
 *  На этом таймере мы настроим Delay и аналог HAL_GetTick()
 *  PM0056 STM32F10xxx/20xxx/21xxx/L1xxxx Cortex®-M3 programming manual/
 *  см. п.4.5 SysTick timer (STK) (стр. 150)
 ***************************************************************************************
 */
void CMSIS_SysTick_Timer_init(void) {
	/* п. 4.5.1 SysTick control and status register (STK_CTRL) (стр. 151)*/

	/**
	*  Bit 0 ENABLE : Counter enable
	*  Enables the counter.When ENABLE is set to 1, the counter loads the RELOAD value from the
	*  LOAD register and then counts down.On reaching 0, it sets the COUNTFLAG to 1 and
	*  optionally asserts the SysTick depending on the value of TICKINT.It then loads the RELOAD
	*  value again, and begins counting.
	*  0 : Counter disabled
	*  1 : Counter enabled
	*/

	CLEAR_BIT(SysTick->CTRL, SysTick_CTRL_ENABLE_Msk); //Выключим таймер для проведения настроек.

	/**
	*  Bit 1 TICKINT: SysTick exception request enable
	*  0: Counting down to zero does not assert the SysTick exception request
	*  1: Counting down to zero to asserts the SysTick exception request.
	*  Note: Software can use COUNTFLAG to determine if SysTick has ever counted to zero.
	*/
	SET_BIT(SysTick->CTRL, SysTick_CTRL_TICKINT_Msk); //Разрешим прерывания по таймеру
	//Прерывание будет происходить каждый раз, когда счетчик отсчитает от заданного значения до 0.

	/**
	*  Bit 2 CLKSOURCE : Clock source selection
	*  Selects the clock source.
	*  0 : AHB / 8
	*  1 : Processor clock(AHB)
	*/
	SET_BIT(SysTick->CTRL, SysTick_CTRL_CLKSOURCE_Msk); //Выберем без делителя. Будет 72MHz

	/**
	*  Bit 16 COUNTFLAG:
	*  Returns 1 if timer counted to 0 since last time this was read.
	*/

	/**
	*  Bits 15:3 Reserved, must be kept cleared.
	*/

	/*Следующий п. 4.5.2 SysTick reload value register (STK_LOAD) (Стр 152)*/
		//Помним, что таймер у нас все еще выключен.

	/**
	*  Bits 23 : 0 RELOAD[23 : 0] : RELOAD value
	*  The LOAD register specifies the start value to load into the VAL register when the counter is
	*  enabled and when it reaches 0.
	*  Calculating the RELOAD value
	*  The RELOAD value can be any value in the range 0x00000001 - 0x00FFFFFF. A start value of
	*  0 is possible, but has no effect because the SysTick exception request and COUNTFLAG are
	*  activated when counting from 1 to 0.
	*  The RELOAD value is calculated according to its use :
	*  l To generate a multi - shot timer with a period of N processor clock cycles, use a RELOAD
	*  value of N - 1. For example, if the SysTick interrupt is required every 100 clock pulses, set
	*  RELOAD to 99.
	*  l To deliver a single SysTick interrupt after a delay of N processor clock cycles, use a
	*  RELOAD of value N.For example, if a SysTick interrupt is required after 400 clock
	*  pulses, set RELOAD to 400.
	*/

