Solderingironspb/STM32F103C8T6_CMSIS_notes/CMSIS_SPI_Slave/Core/Src/stm32f103xx_CMSIS.c
	MODIFY_REG(SysTick->LOAD, SysTick_LOAD_RELOAD_Msk, 71999 << SysTick_LOAD_RELOAD_Pos); //Настроим прерывание на частоту в 1 кГц(т.е. сработка будет каждую мс)

	/**
	Bits 31:24 Reserved, must be kept cleared.
	*/

	/*Следующий п. 4.5.3 SysTick current value register (STK_VAL) (Стр. 153)*/

	/**
	*  CURRENT[23:0]: Current counter value
	*  The VAL register contains the current value of the SysTick counter.
	*  Reads return the current value of the SysTick counter.
	*  A write of any value clears the field to 0, and also clears the COUNTFLAG bit in the
	*  STK_CTRL register to 0
	*/

	MODIFY_REG(SysTick->VAL, SysTick_VAL_CURRENT_Msk, 71999 << SysTick_VAL_CURRENT_Pos); //Начнем считать с 71999

	/*Есть там еще регистр калибровки, но я его трогать не буду*/

	SET_BIT(SysTick->CTRL, SysTick_CTRL_ENABLE_Msk); //Запускаем таймер

}

/**
 ***************************************************************************************
 *  @breif Настройка Delay и аналог HAL_GetTick()
 ***************************************************************************************
 */

volatile uint32_t SysTimer_ms = 0; //Переменная, аналогичная HAL_GetTick()
volatile uint32_t Delay_counter_ms = 0; //Счетчик для функции Delay_ms
volatile uint32_t Timeout_counter_ms = 0; //Переменная для таймаута функций

/**
 ******************************************************************************
 *  @breif Delay_ms
 *  @param   uint32_t Milliseconds - Длина задержки в миллисекундах
 ******************************************************************************
 */
void Delay_ms(uint32_t Milliseconds) {
	Delay_counter_ms = Milliseconds;
	while (Delay_counter_ms != 0);
}

/**
 ******************************************************************************
 *  @breif Прерывание по флагу COUNTFLAG (см. п. 4.5.1 SysTick control and status register (STK_CTRL))
 *  Список векторов(прерываний) можно найти в файле startup_stm32f103c8tx.S
 ******************************************************************************
 */
void SysTick_Handler(void) {

	SysTimer_ms++;

	if (Delay_counter_ms) {
		Delay_counter_ms--;
	}
	if (Timeout_counter_ms) {
		Timeout_counter_ms--;
	}
}



/*============================== НАСТРОЙКА GPIO =======================================*/
/**
 ***************************************************************************************
 *  @breif Настройка GPIO
 *  Reference Manual/см. п.9.2 GPIO registers (стр. 171)
 *  Перед настройкой (GPIOs and AFIOs) нужно включить тактирование порта.
 ***************************************************************************************
 */

 /*Пример настройки портов*/

 /*Включение или выключение тактирования порта*/
 // SET_BIT(RCC->RCC_APB2ENR_AFIOEN, RCC_APB2ENR_IOPAEN); //Запуск тактирования порта A
 //CLEAR_BIT(RCC->RCC_APB2ENR_AFIOEN, RCC_APB2ENR_IOPAEN); //Выключить тактирование порта A

 // SET_BIT(RCC->RCC_APB2ENR_AFIOEN, RCC_APB2ENR_IOPBEN); //Запуск тактирования порта B
 //CLEAR_BIT(RCC->RCC_APB2ENR_AFIOEN, RCC_APB2ENR_IOPBEN); //Выключить тактирование порта B

 // SET_BIT(RCC->RCC_APB2ENR_AFIOEN, RCC_APB2ENR_IOPCEN); //Запуск тактирования порта C
 //CLEAR_BIT(RCC->RCC_APB2ENR_AFIOEN, RCC_APB2ENR_IOPCEN); //Выключить тактирование порта C

 // SET_BIT(RCC->RCC_APB2ENR_AFIOEN, RCC_APB2ENR_IOPDEN); //Запуск тактирования порта D
 //CLEAR_BIT(RCC->RCC_APB2ENR_AFIOEN, RCC_APB2ENR_IOPDEN); //Выключить тактирование порта D

 /**
 *  Далее нас встречают 2 регистра:
 *  CRL и CRH (см. п 9.2.1 Port configuration register low (GPIOx_CRL) (x=A..G) (стр. 171)
 *  и п. 9.2.2 Port configuration register high (GPIOx_CRH) (x=A..G) (стр. 172))
 *  CRL предназначен для пина с 0 по 7
 *  CRH предназначен для пина с 8 по 15
 */

 /**
 *  Bits 29 : 28, 25 : 24,
 *  21 : 20, 17 : 16, 13 : 12,
 *  9 : 8, 5 : 4, 1 : 0
 *  MODEy[1 : 0] : Port x mode bits(y = 0 .. 7)
 *  These bits are written by software to configure the corresponding I / O port.
 *  Refer to Table 20 : Port bit configuration table.
 *  00 : Input mode(reset state)
 *  01 : Output mode, max speed 10 MHz.
 *  10 : Output mode, max speed 2 MHz.
 *  11 : Output mode, max speed 50 MHz
 */

 //MODIFY_REG(GPIOC->CRH, GPIO_CRH_MODE13, 0b11 << GPIO_CRH_MODE13_Pos); //Настройка GPIOC порта 13 на выход со максимальной скоростью в 50 MHz

 /**
 *  Bits 31 : 30, 27 : 26,
 *  23 : 22, 19 : 18, 15 : 14,
 *  11 : 10, 7 : 6, 3 : 2
 *  CNFy[1 : 0] : Port x configuration bits(y = 0 .. 7)
 *  These bits are written by software to configure the corresponding I / O port.
 *  Refer to Table 20 : Port bit configuration table.
 *  In input mode(MODE[1 : 0] = 00) :
 *  00 : Analog mode
 *  01 : Floating input(reset state)
 *  10 : Input with pull - up / pull - down
 *  11 : Reserved
 *  In output mode(MODE[1 : 0] > 00) :
 *  00 : General purpose output push - pull
 *  01 : General purpose output Open - drain
 *  10 : Alternate function output Push - pull
 *  11 : Alternate function output Open - drain
 */

 //т.к. ножку мы настроили в Output, то мы можем выбрать:
 //  In output mode(MODE[1 : 0] > 00) :
 //  00 : General purpose output push - pull
 //  01 : General purpose output Open - drain
 //  10 : Alternate function output Push - pull
 //  11 : Alternate function output Open - drain

 //MODIFY_REG(GPIOC->CRH, GPIO_CRH_CNF13, 0b00 << GPIO_CRH_CNF13_Pos); //Настройка GPIOC порта 13 на выход в режиме Push-Pull

 /*А теперь два примера*/

 /**
  ***************************************************************************************
  *  @breif Инициализация PIN PC13 на выход в режиме Push-Pull с максимальной скоростью 50 MHz
  *  Reference Manual/см. п.9.2 GPIO registers (стр. 171)
  *  Перед настройкой (GPIOs and AFIOs) нужно включить тактирование порта.
  ***************************************************************************************
  */
void CMSIS_PC13_OUTPUT_Push_Pull_init(void) {
	SET_BIT(RCC->APB2ENR, RCC_APB2ENR_IOPCEN); //Запуск тактирования порта C
	MODIFY_REG(GPIOC->CRH, GPIO_CRH_MODE13, 0b10 << GPIO_CRH_MODE13_Pos); //Настройка GPIOC порта 13 на выход со максимальной скоростью в 50 MHz
	MODIFY_REG(GPIOC->CRH, GPIO_CRH_CNF13, 0b00 << GPIO_CRH_CNF13_Pos); //Настройка GPIOC порта 13 на выход в режиме Push-Pull
}

/**
 ***************************************************************************************
 *  @breif Blink PIN PC13 на выход в режиме Push-Pull
 ***************************************************************************************
 */
void CMSIS_Blink_PC13(uint32_t ms) {
	GPIOC->BSRR = GPIO_BSRR_BR13;
	Delay_ms(ms);
	GPIOC->BSRR = GPIO_BSRR_BS13;
	Delay_ms(ms);
}

/**
 ***************************************************************************************
 *  @breif Настройка MCO c выходом на ножку PA8
 *  Reference Manual/см. п.9.2 GPIO registers (стр. 171)
 *  Перед настройкой (GPIOs and AFIOs) нужно включить тактирование порта.
 ***************************************************************************************
 */
void CMSIS_PA8_MCO_init(void) {
	//Тактирование MCO должно быть настроено в регистре RCC
	MODIFY_REG(RCC->CFGR, RCC_CFGR_MCO, RCC_CFGR_MCO_PLLCLK_DIV2); //В качестве тактирования для MCO выбрал PLL. Будет 36 MHz.
	SET_BIT(RCC->APB2ENR, RCC_APB2ENR_IOPAEN); //Запуск тактирования порта A
	MODIFY_REG(GPIOA->CRH, GPIO_CRH_MODE8, 0b11 << GPIO_CRH_MODE8_Pos); //Настройка GPIOA порта 8 на выход со максимальной скоростью в 50 MHz
	MODIFY_REG(GPIOA->CRH, GPIO_CRH_CNF8, 0b10 << GPIO_CRH_CNF8_Pos); //Настройка GPIOA порта 8, как альтернативная функция, в режиме Push-Pull
}

/*================================ РЕЖИМ EXTI =======================================*/

/**
 ***************************************************************************************
 *  @breif Режим EXTI.
 *  Reference Manual/см. п. 10 Interrupts and events (стр. 197)
 *  Тема прерываний очень важна, и читать про EXTI нужно именно с 10 пункта.
 ***************************************************************************************
 */

 //  10.1.1 SysTick calibration value register
 //  The SysTick calibration value is set to 9000, which gives a reference time base of 1 ms with
 //  the SysTick clock set to 9 MHz(max HCLK / 8).
 //  Не совсем понял эту тему про 9 MHz, т.к. мы ее можем настроить на любую частоту. В пункте про настройку SysTimer, мы не использовали деление на 8.

 //  В пункте 10.1.2 Interrupt and exception vectors можно просмотреть таблицу векторов(прерываний), которые мы можем использовать.
 //  Таблицу векторов можно просмотреть в файле startup_stm32f103c8tx.S
 //  См. Figure 21. External interrupt/event GPIO mapping (стр. 210)
 //  у нас есть несколько EXTI 0-15.
 //  К каждому подключены входы ножек.
 //  Нельзя создать одно EXTI прерывание с нескольких ног одновременно.
 //  Пример: EXTI0. Тогда мы должны выбирать, либо PA0, либо PB0, либо PC0 и т.д.
 //  Под маппингом на стр. 210 есть сноска:

 /**
 *  1. To configure the AFIO_EXTICRx for the mapping of external interrupt/event lines onto GPIOs, the AFIO
 *  clock should first be enabled. Refer to Section 7.3.7: APB2 peripheral clock enable register
 *  (RCC_APB2ENR) for low-, medium-, high- and XL-density devices and, to Section 8.3.7: APB2 peripheral
 *  clock enable register (RCC_APB2ENR) for connectivity line devices.
 */

 //  Это значит, что сначала, перед выбором ножки на EXTI вход, нужно включить тактирование AFIO.

void CMSIS_RCC_AFIO_enable(void) {
	SET_BIT(RCC->APB2ENR, RCC_APB2ENR_AFIOEN); //Включить тактирование для альтернативных функций
}
//  После этого, нам нужно настроить регистр AFIO->EXTICR1, чтоб выбрать ножку для создания прерывания.
//  Для примера, мы хотим использовать ножку PB0 для создания прерывания на EXTI0.

// см. п. 9.4.3 External interrupt configuration register 1 (AFIO_EXTICR1) (стр. 191)

/**
*  Bits 15:0 EXTIx[3:0]: EXTI x configuration (x= 0 to 3)
*  These bits are written by software to select the source input for EXTIx external interrupt.
*  Refer to Section 10.2.5: External interrupt/event line mapping
*  0000: PA[x] pin
*  0001: PB[x] pin
*  0010: PC[x] pin
*  0011: PD[x] pin
*  0100: PE[x] pin
*  0101: PF[x] pin
*  0110: PG[x] pin
*/

