Solderingironspb/STM32F103C8T6_CMSIS_notes/CMSIS_SPI_Slave/Core/Src/stm32f103xx_CMSIS.c
void CMSIS_AFIO_EXTICR1_B0_select(void) {
	MODIFY_REG(AFIO->EXTICR[0], AFIO_EXTICR1_EXTI0, AFIO_EXTICR1_EXTI0_PB); //AFIO_EXTICR1, EXTI0, выбран порт B.
}

/**
*  Bits 31:16 Reserved
*/

// Далее следует настроить ножку PB0 на вход. Можем сделать подтяжку.

void CMSIS_PB0_INPUT_Pull_Down_init(void) {
	SET_BIT(RCC->APB2ENR, RCC_APB2ENR_IOPBEN); //Включим тактирование порта B
	MODIFY_REG(GPIOB->CRL, GPIO_CRL_CNF0, 0b10 << GPIO_CRL_CNF0_Pos); //Настроим ножку PB0 в режим Input with pull-up / pull-down
	MODIFY_REG(GPIOB->CRL, GPIO_CRL_MODE0, 0b00 << GPIO_CRL_MODE0_Pos); //Настройка в режим Input
	GPIOB->BSRR = GPIO_BSRR_BR0; //Подтяжка к земле
}

//  Теперь можем перейти к п. 10.3 (стр. 211)

/**
*  10.3 EXTI registers
*  Refer to Section 2.2 on page 45 for a list of abbreviations used in register descriptions.
*  The peripheral registers have to be accessed by words (32-bit).
*/

//  Здесь есть 2 регистра Interrupt mask register (EXTI_IMR) и Event mask register (EXTI_EMR)

void CMSIS_EXTI_0_init(void) {

	/**
	*  Bits 19:0 MRx: Interrupt Mask on line x
	*  0: Interrupt request from Line x is masked
	*  1: Interrupt request from Line x is not masked
	*  Note: Bit 19 is used in connectivity line devices only and is reserved otherwise
	*/

	SET_BIT(EXTI->IMR, EXTI_IMR_MR0); //Включаем прерывание EXTI0 по входному сигналу

	/**
	*  Bits 31:20 Reserved, must be kept at reset value (0).
	*/

	/*То же самое и для EMR, только оно нам не нужно пока*/
	//CLEAR_BIT(EXTI->EMR, EXTI_EMR_EM0);//Событие нам не нужно, поэтому поставим сюда 0.

	/*Реагирование по фронту и спаду сигнала см. п. 10.3.3 Rising trigger selection register (EXTI_RTSR) (Стр. 212)*/

	/**
	*  Bits 19:0 TRx: Rising trigger event configuration bit of line x
	*  0: Rising trigger disabled (for Event and Interrupt) for input line
	*  1: Rising trigger enabled (for Event and Interrupt) for input line.
	*  Note: Bit 19 is used in connectivity line devices only and is reserved otherwise
	*
	*  Note: The external wakeup lines are edge triggered, no glitches must be generated on these lines.
	*  If a rising edge on external interrupt line occurs during writing of EXTI_RTSR register, the
	*  pending bit will not be set.
	*  Rising and Falling edge triggers can be set for the same interrupt line. In this configuration,
	*  both generate a trigger condition.
	*/
	SET_BIT(EXTI->RTSR, EXTI_RTSR_TR0); //Реагирование по фронту вкл.
	//SET_BIT(EXTI->FTSR, EXTI_FTSR_TR0);//Реагирование по спаду вкл.

	/**
	*  Bits 31:20 Reserved, must be kept at reset value (0)
	*/

	/**
	*   10.3.5 Software interrupt event register (EXTI_SWIER)
	*   Используется для софтварного запуска прерывания
	*/

	/**
	*  Bits 19:0 SWIERx: Software interrupt on line x
	*  If the interrupt is enabled on this line in the EXTI_IMR, writing a '1' to this bit when it is set to
	*  '0' sets the corresponding pending bit in EXTI_PR resulting in an interrupt request generation.
	*  This bit is cleared by clearing the corresponding bit of EXTI_PR (by writing a 1 into the bit).
	*  Note: Bit 19 used in connectivity line devices and is reserved otherwise
	*/
	//SET_BIT(EXTI->SWIER, EXTI_SWIER_SWIER0);//Это софтварное включение прерывания

	/*
	*  Bits 31:20 Reserved, must be kept at reset value (0)
	*/

	/**
	*  п. 10.3.6 Pending register (EXTI_PR)
	*  Нужен для выхода из прерывания. Вставляется в Handler.
	*  Если не сбросить, то так в прерывании и зависнем.
	*/

	/**
	*  Bits 19:0 PRx: Pending bit
	*  0: No trigger request occurred
	*  1: selected trigger request occurred
	*  This bit is set when the selected edge event arrives on the external interrupt line. This bit is
	*  cleared by writing a ‘1’ into the bit.
	*  Note: Bit 19 is used in connectivity line devices only and is reserved otherwise.
	*/

	// SET_BIT(EXTI->PR, EXTI_PR_PR0); //Команда выхода из прерывания

	/**
	*  Bits 31:20 Reserved, must be kept at reset value (0)
	*/

	NVIC_EnableIRQ(EXTI0_IRQn); //Включим прерывание по вектору EXTI0
}

__WEAK void EXTI0_IRQHandler(void) {

	SET_BIT(EXTI->PR, EXTI_PR_PR0); //Выйдем из прерывания

}

/*================================ Таймеры на примере TIM3 =======================================*/

/**
 ***************************************************************************************
 *  @breif General-purpose timers (TIM2 to TIM5)
 *  Reference Manual/см. п. 15 General-purpose timers (TIM2 to TIM5) (стр. 365)
 *  Рассмотрим все регистры, разберемся куда смотреть и прочее
 ***************************************************************************************
 */
 /**
 *  Счетчик 16 битный. PSC тоже 16 бит.
 *  The time - base unit includes :
 *  Counter register(TIMx_CNT) - регистр счетчика
 *  Prescaler register(TIMx_PSC) - предделитель частоты
 *  Auto - Reload register(TIMx_ARR) - Регистр автоматической перезагрузки
 *
 *  Счетчик тактируется выходом предделителя CK_CNT, который активируется только тогда, когда бит
 *  разрешения счетчика CEN, находищийся в регистре TIMx_CR1 установлен в 1.
 *  Важно: Фактический сигнал включения счетчика CNT_EN устанавливается через 1 такт после включения бита CEN
 *  В TIMx->PSC можно устанавливать любой коэффициент от 0 до 65535.
 *  Его можно изменять налету, т.к. он буферизирован.
 */
 /**
 *  Counter modes
 *  Upcounting mode
 *  В режиме Up, счетчик считает от 0 до значения автоперезагрузки (TIMx->ARR), затем перезапускается с 0
 *  и генерирует событие переполнения счетчика.
 *  Событие Update может генерироваться при каждом переполнении счетчика, либо
 *  при установке бита UG в регистре TIMx->EGR(программно или в slave mode)
 *
 *  Событие UEV можно отключить программно, если установить бить UDIS в TIMx->CR1.
 *  Тогда можно избежать обновления теневых регистров при записи новых значений в регистры
 *  предварительной загрузки. Событие Update не будет происходить, пока в UDIS не будет записан 0.
 *  Однако счетчик как перезапускался через 0, так и будет перезапускаться при переполнении, но скорость меняться
 *  не будет.
 *  Кроме того, если установить бит URS (выбор запроса на обновление) в TIMx->CR1,
 *  то установка бита UG генерирует событие update UEV, но без установки флага UIF(Таким образом
 *  не отправляется запрос interrupt или DMA). Это делается для того, чтоб избежать генерации прерываний
 *  update, так и прерывания захвата при очистке счетчика события захвата.
 *
 *  Когда происходит Update event, обновляются все регистры и устанавливается флаг
 *  UIF в регистре TIMx->SR
 *  Вместе с этим:
 *  - буфер TIMx->PSC перезагружается новым значением
 *  - теневой регистр автоматической перезагрузки обновляется значением из TIMx->ARR

