Solderingironspb/STM32F103C8T6_CMSIS_notes/CMSIS_SPI_Slave/Core/Src/stm32f103xx_CMSIS.c
 *  ARPE(auto-reload preload) в TIMx->CR1 отвечает за буферизацию TIMx->ARR
 *  т.е. если в TIMx->CR1 бит ARPE будет 1, то если изменить TIMx->ARR, то возникнет тут же Update Event
 *  и значение TIMx->ARR применится, не дожидаясь завершения счетчика до переполнения.
 */

 /**
 *  Center-aligned mode (up/down counting)
 *  В режиме с выравнивание по центру, счетчик считает от 0 до значения автоперезагрузки(TIMx->ARR),
 *  генерирует событие переполнения счетчика, а затем ведет обратный отсчет до 1, генерирует
 *  событие опустошения счетчика, а затем перезапускает счетчик с 0.
 *
 *  Center-aligned mode включен, когда биты CMS в регистре TIMx->CR1 не равны 0.
 *  01 - Флаг прерывания возникает на счетчике Down
 *  02 - Флаг прерывания возникает на счетчика Up
 *  03 - Флаг прерывания возникает и на Down, и на Up
 *  Примечание: Нельзя из Edge режима перейти в Center-aligned mode, если счетчик запущен.
 *  Так же в этом режиме бит направления DIR из регистра TIMx->CR1 не может меняться.
 *  Он обновляется аппаратно и выдает текущее направление счетчика.

 */

void CMSIS_TIM3_init(void) {
	/*Включим тактирование таймера (страница 48)*/
	SET_BIT(RCC->APB1ENR, RCC_APB1ENR_TIM3EN); //Запуск тактирования таймера 3
	SET_BIT(RCC->APB2ENR, RCC_APB2ENR_AFIOEN); //Запуск тактирования альтернативных функций

	/*Настройка таймера 3 (Страница 404)*/
	//15.4.1 TIMx control register 1 (TIMx_CR1)

	//SET_BIT(TIM3->CR1, TIM_CR1_CEN);  //Запуск таймера
	CLEAR_BIT(TIM3->CR1, TIM_CR1_UDIS); //Генерировать событие Update
	CLEAR_BIT(TIM3->CR1, TIM_CR1_URS); //Генерировать прерывание
	CLEAR_BIT(TIM3->CR1, TIM_CR1_OPM); //One pulse mode off(Счетчик не останавливается при обновлении)
	CLEAR_BIT(TIM3->CR1, TIM_CR1_DIR); //Считаем вверх
	MODIFY_REG(TIM3->CR1, TIM_CR1_CMS_Msk, 0b00 << TIM_CR1_CMS_Pos); //Выравнивание по краю
	SET_BIT(TIM3->CR1, TIM_CR1_ARPE); //Auto-reload preload enable
	MODIFY_REG(TIM3->CR1, TIM_CR1_CKD_Msk, 0b00 << TIM_CR1_CKD_Pos); //Предделение выключено

	/*Настройка прерываний (Страница 409)*/
	//15.4.4 TIMx DMA/Interrupt enable register (TIMx_DIER)
	SET_BIT(TIM3->DIER, TIM_DIER_UIE); //Update interrupt enable

	//15.4.5 TIMx status register (TIMx_SR) - Статусные регистры

	TIM3->PSC = 7200 - 1;
	TIM3->ARR = 10 - 1;

	NVIC_EnableIRQ(TIM3_IRQn); //Разрешить прерывания по таймеру 3
	SET_BIT(TIM3->CR1, TIM_CR1_CEN); //Запуск таймера
}

void CMSIS_TIM3_PWM_CHANNEL1_init(void) {
	/*Настройка ножки PA6 под ШИМ*/
	SET_BIT(RCC->APB2ENR, RCC_APB2ENR_IOPAEN); //Включим тактирование порта А
	MODIFY_REG(GPIOA->CRL, GPIO_CRL_CNF6_Msk, 0b10 << GPIO_CRL_CNF6_Pos);
	MODIFY_REG(GPIOA->CRL, GPIO_CRL_MODE6_Msk, 0b11 << GPIO_CRL_MODE6_Pos);

	/*Настройка шим(Канал 1)*/
	MODIFY_REG(TIM3->CCMR1, TIM_CCMR1_CC1S_Msk, 0b00 << TIM_CCMR1_CC1S_Pos); //CC1 channel is configured as output
	CLEAR_BIT(TIM3->CCMR1, TIM_CCMR1_OC1FE); //Fast mode disable
	SET_BIT(TIM3->CCMR1, TIM_CCMR1_OC1PE); //Preload enable
	MODIFY_REG(TIM3->CCMR1, TIM_CCMR1_OC1M_Msk, 0b110 << TIM_CCMR1_OC1M_Pos); //PWM MODE 1
	CLEAR_BIT(TIM3->CCMR1, TIM_CCMR1_OC1CE); //OC1Ref is not affected by the ETRF input

	/*Запуск ШИМ*/
	//15.4.9 TIMx capture/compare enable register (TIMx_CCER)
	SET_BIT(TIM3->CCER, TIM_CCER_CC1E); //On - OC1 signal is output on the corresponding output pin. 
	SET_BIT(TIM3->CCER, TIM_CCER_CC1P); //OC1 active high.

	TIM3->CCR1 = 5;
}

void CMSIS_TIM3_PWM_CHANNEL2_init(void) {
	/*Настройка ножки PA7 под ШИМ*/
	SET_BIT(RCC->APB2ENR, RCC_APB2ENR_IOPAEN); //Включим тактирование порта А
	MODIFY_REG(GPIOA->CRL, GPIO_CRL_CNF7_Msk, 0b10 << GPIO_CRL_CNF7_Pos);
	MODIFY_REG(GPIOA->CRL, GPIO_CRL_MODE7_Msk, 0b11 << GPIO_CRL_MODE7_Pos);

	/*Настройка шим(Канал 2)*/
	MODIFY_REG(TIM3->CCMR1, TIM_CCMR1_CC2S_Msk, 0b00 << TIM_CCMR1_CC2S_Pos); //CC1 channel is configured as output
	CLEAR_BIT(TIM3->CCMR1, TIM_CCMR1_OC2FE); //Fast mode disable
	SET_BIT(TIM3->CCMR1, TIM_CCMR1_OC2PE); //Preload enable
	MODIFY_REG(TIM3->CCMR1, TIM_CCMR1_OC2M_Msk, 0b110 << TIM_CCMR1_OC2M_Pos); //PWM MODE 1
	CLEAR_BIT(TIM3->CCMR1, TIM_CCMR1_OC2CE); //OC1Ref is not affected by the ETRF input

	/*Запуск ШИМ*/
	//15.4.9 TIMx capture/compare enable register (TIMx_CCER)
	SET_BIT(TIM3->CCER, TIM_CCER_CC2E); //On - OC1 signal is output on the corresponding output pin. 
	CLEAR_BIT(TIM3->CCER, TIM_CCER_CC2P); //OC1 active high.

	TIM3->CCR2 = 5;
}

__WEAK void TIM3_IRQHandler(void) {
	if (READ_BIT(TIM3->SR, TIM_SR_UIF)) {
		CLEAR_BIT(TIM3->SR, TIM_SR_UIF); //Сбросим флаг прерывания
	}
}

/*================================= НАСТРОЙКА ADC ============================================*/

/**
***************************************************************************************
*  @breif Analog-to-digital converter (ADC)
*  Reference Manual/см. п.11 Analog-to-digital converter (ADC) (стр. 215)
***************************************************************************************
*/
//STM32 имеет 12 разрядный АЦП последовательного приближения.
//Он имеет до 18 мультиплексированных каналов, позволяющих измерять сигналы от шестнадцати внешних и двух
//внутренних источников.
//Аналого-цифровое преобразование различных каналов может выполняться в одиночном, непрерывном или прерывистом режиме.
//Результат АЦП сохраняется в 16-разрядном регистре данных с выравниванием по левому или правому краю.

//Входной тактовый сигнал АЦП генерируется из тактового сигнала PCLK2, деленного на prescaler.
//Максимальная частота не должна превышать 14 МГц.

/*                                   Table 65. ADC pins                                                */
/*
	 Name     |        Signal type                | Remarks
	 VREF+    | Input, analog reference positive  | The higher/positive reference voltage for the ADC,
			  |                                   |          2.4 V <= VREF+ <= VDDA
	VDDA(1)   |       Input, analog supply        | Analog power supply equal to VDD and
			  |                                   |          2.4 V <= VDDA <= 3.6 V
	 VREF-    | Input, analog reference negative  | The lower/negative reference voltage for the ADC,
			  |                                   |              VREF- = VSSA
	VSSA(1)   |    Input, analog supply ground    |    Ground for analog power supply equal to VSS
ADCx_IN[15:0] |         Analog signals            |           Up to 21 analog channels(2)
*/

/*11.3.1 ADC on-off control(стр. 218)*/
//АЦП можно включить, установив бит ADON в регистре ADC_CR2. 
//Когда бит ADON устанавливается в первый раз, он пробуждает АЦП из режима Power Down.
//Преобразование начинается, когда бит ADON устанавливается программой во второй раз по истечении времени включения АЦП(tSTAB).
//Преобразование можно остановить, а АЦП перевести в режим пониженного энергопотребления, сбросив бит ADON.
//В этом режиме АЦП почти не потребляет энергии (всего несколько мкА).	

/*11.3.3 Channel selection(стр. 218)*/
//Имеется 16 мультиплексированных каналов. Конверсии можно разделить на две группы:
//регулярные и инжектированные. Группа состоит из последовательности преобразований, которые можно
//выполнять на любом канале и в любом порядке. Например можно выполнить преобразование в следующем порядке:
//Ch3, Ch8, Ch2, Ch2, Ch0, Ch2, Ch2, Ch15.
/*
 * Регулярная группа состоит из 16 преобразований. Регулярные каналы и порядок последовательности
 * преобразований должен быть настроен в регистрах ADC_SQRx.
 * Общее количество преобразований в регулярной группе должно быть записано в битах L[3:0] в регистре ADC_SQR1
 *
 * Инжектированная группа состоит из 4 преобразований. Вводимые канали и их порядок последовательности преобразований
 * настраиваются в регистре ADC_ISQR. Общее количество преобразований в инжектируемой группе должно быть записано в битах
 * L[1:0] в регистре ADC_ISQR.
 *
 * Если регистры ADC_SQRx или ADC_ISQR изменяются во время преобразования, то текущее преобразование сбрасывается и на АЦП
 * отправляется новый стартовый импульс для преобразования новой выбранной группы.
 * */

 /*Temperature sensor/VREFINT internal channels*/
 /* Датчик температуры подключен к каналу ADCx_IN16, а внутреннее опорное напряжение VREFint подключено к ADCx_IN17.
  * Эти два внутренних канала можно выбрать и преобразовать через инжектированные или регулярные каналы.*/

  /*11.4 Calibration*/
  /* АЦП имеет встроенный режим самокалибровки. Калибровка значительно снижает ошибки точности из-за внутренних
   * изменений внутреннего конденсатора. Во время калибровки для каждого конденсатора вычисляется код исправления ошибок,
   * и во время всех последующих преобразований эта ошибка устраняется.
   *
   * Калибровка запускается установкой бита CAL в регистре ADC_CR2.
   *
   * После завершения калибровки, бит CAL сбрасывается аппаратно, и можно выполнить обычное преобразование.
   * Рекомендуется калибровать АЦП один раз при включении питания. Коды калибровки сохраняются в ADC_DR, как только фаза
   * калибровки заканчивается.
   *
   * Важно: перед началом калибровки АЦП должен находиться во включенном состоянии(бит ADON = 1) не менее двух тактов тактовой частоты АЦП.
   * */

   /*11.8 DMA request(стр. 227)*/
   /* Поскольку преобразованные значения регулярных каналов хранятся в уникальном регистре данных, то необходимо
	* использовать DMA для преобразования более чем одного обычного канала. Это позволяет избежать потери данных,
	* уже сохраненных в регистре ADC_DR.
	*
	* Только окончание преобразования обычного канала генерирует запрос DMA, который разрешает передачу его преобразованных данных
	* из регистра ADC_DR в место назначения, выбранное пользователем.*/

	/*11.11 ADC interrupts(стр. 236)*/
	/*
	 * Прерывание может быть создано в конце преобразования для регулярных и инжектированных групп, а также при установке
	 * бита состояния аналогового сторожевого устройства.
	 *
	 * Прерывания ADC1 и ADC2 отображаются на один и тот же вектор прерывания. Прерывания ADC3 отображаются на отдельный
	 * вектор прерывания.
	 * */

