Solderingironspb/STM32F103C8T6_CMSIS_notes/CMSIS_SPI_Slave/Core/Src/stm32f103xx_CMSIS.c
	// 11.12.11 ADC regular sequence register 3 (ADC_SQR3)(страница 249)
	MODIFY_REG(ADC1->SQR3, ADC_SQR3_SQ1_Msk, 0 << ADC_SQR3_SQ1_Pos);
	MODIFY_REG(ADC1->SQR3, ADC_SQR3_SQ2_Msk, 17 << ADC_SQR3_SQ2_Pos);
	//NVIC_EnableIRQ(ADC1_IRQn); //Разрешить прерывания по АЦП

	//SET_BIT(ADC1->CR2, ADC_CR2_SWSTART); //Начать преобразование. Не нужно запускать, если Continuous conversion mode(непрерывные преобразования) включен
}

__WEAK void ADC1_2_IRQHandler(void) {
	/*This bit is set by hardware at the end of a group channel conversion (regular or injected). It is
	* cleared by software or by reading the ADC_DR.
	* 0: Conversion is not complete
	* 1: Conversion complete*/
	if (READ_BIT(ADC1->SR, ADC_SR_EOC)) {
		ADC1->DR; //Читаем канал, чтоб сбросить флаг
	}

}
__WEAK void DMA1_Channel1_IRQHandler(void) {
	if (READ_BIT(DMA1->ISR, DMA_ISR_TCIF1)) {
		SET_BIT(DMA1->IFCR, DMA_IFCR_CGIF1); //Сбросим глобальный флаг.
		/*Здесь можно писать код*/

	}
	else if (READ_BIT(DMA1->ISR, DMA_ISR_TEIF1)) {
		/*Здесь можно сделать какой-то обработчик ошибок*/
		SET_BIT(DMA1->IFCR, DMA_IFCR_CGIF1); //Сбросим глобальный флаг.
	}
}

/*================================= НАСТРОЙКА USART ============================================*/

/**
***************************************************************************************
*  @breif Universal synchronous asynchronous receiver transmitter (USART)
*  Reference Manual/см. п.27 Universal synchronous asynchronous receiver transmitter (USART) (стр. 785)
***************************************************************************************
*/

/*Универсальный синхронный/асинхронный приемопередатчик USART дает гибкую возможность
полнодюплексного обмена данными с внешним оборудованием, требующим промышленный стандарты NRZ.
Код NRZ (Non Return to Zero – без возврата к нулю) – это простейший код, представляющий собой
обычный цифровой сигнал. USART дает очень широкий диапазон скоростей передачи данных, используя
baud rate generator.

Он поддерживает синхронную одностороннюю связь и полудуплексную однопроводную связь, спецификации LIN,
протокол смарт-карт, спецификации SIR ENDEC и IrDA(передача по ИК каналу, а также операции модема (CTS/RTS)).
Возможна высокоскоростная передача данных при использовании DMA для конфигурации с несколькими буферами.*/

/*Основные возможности USART*/
/*
 * -  Full duplex, asynchronous communications
 * -  NRZ стандарт (Mark/Space)
 * -  Настраиваемая скорость(baud rate generator)
 *    Общая программируемая скорость передачи и приема до 4.5 МБит/с
 * -  Программируемая длина слова данных (8 и 9 бит)
 * -  Настраиваемые стоповые биты. Поддержка 1 или 2 стоповых битов.
 * -  Возможность отправки синхронного прерывания ведущего LIN и возможность обнаружения разрыва связи с ведомым LIN.
 * -  Генерация 13-битного разрыва и обнаружение 10/11 битного разрыва, когда USART аппаратно сконфигурирован для LIN.
 * -  Выход тактового сигнала (для синхронной передачи)
 * -  IrDA SIR Энкодер и Декодер
 *    Поддержка 3/16 битной длинный для нормального режима
 * -  Возможность эмуляции смарт карт
 * -  Интерфейс Smartcard поддерживает асинхронный протокол Smartcards, как определено в стандартах ISO 7816-3.
 *    0.5, 1.5 стоповые биты ля работы со смарт-картой
 * -  Поддержка однопроводной полудуплексной работы
 * -  Настроиваемая многобуферная связь с использованием DMA.
 *    Буферизация полученных/отправленных байт в зарезервированном в SRAM месте с использованием прямого доступа к памяти.
 * -  Отдельные биты включения для передачи и приема.
 * -  Флаги обнаружения:
 *      - приемный буфер заполнен
 *      - буфер передачи пуст
 *      - флаг окончания передачи
 * -  Контроль четности:
 *      - Передает бит четности
 *      - Проверяет четность полученного байта данных
 * - Четыре флага обнаружения ошибок:
 *      - Ошибка по переполнению
 *      - Шум на линии
 *      - Ошибка кадра
 *      - Ошибка четности
 * - Десять прерываний по флагам:
 *      – CTS changes
 *      – LIN break detection
 *      – Transmit data register empty
 *      – Transmission complete
 *      – Receive data register full
 *      – Idle line received
 *      – Overrun error
 *      – Framing error
 *      – Noise error
 *      – Parity error
 * - Multiprocessor communication - enter into mute mode if address match does not occur
 * - Wake up from mute mode (by idle line detection or address mark detection)
 * - Two receiver wakeup modes: Address bit (MSB, 9th bit), Idle line

 Для любой двунаправленной связи USART требуется как минимум два контакта: вход для приема данных Rx и выход
 для передачи данных Tx.

 RX: Вход для приема данных. Методы передискретизации используются для восстановления данных путем различия достоверных данных и шума.
 TX: Вывод данных. Когда передатчик отключен, выходной контакт возвращается к своей конфигурации порта ввода-вывода.
 Когда передатчик включен и ничего не должно передаваться, то вывод TX находится на высоком уровне. В однопроводном режиме
 и в режиме смарт-карт этот вывод-ввод используется для передачи и приема данных (на уровне USART данные поступают на SW_RX)

 Через TX и RX передаются и принимаются последовательные данные в обычном режиме USART в виде кадров, содержащих:
 - Свободная линия перед передачей или приемом
 - Стартовый бит
 - Слово данных (8 или 9 бит), начиная с младшего значащего бита
 - 0.5, 1, 1.5, 2 стоповые биты, указывающие на завершение кадра.
 - Baud rate generator с 12 битной мантиссой и 4 битной дробью
 - Регистр статуса (USART_SR)
 - Регистр данных (USART_DR)
 - Регистр скорости передачи (USART_BRR) - 12 битная мантисса и 4 битная дробь.
 - Защитный регистр (USART_GTPR) в случае режима смарт-карты

 Для интерфейса в синхронном режиме требуется следующий контакт:
  - CK: тактовый выход передатчика. Этот контакт выводит тактовый сигнал данных передатчика для синхронной передачи,
  соответствующей ведомому режиму SPI(нет тактовых импульсов для стартового и стопового битов, а также
  есть возможность для отправки тактового импульса для последнего бита данных.) Параллельно данные могут быть получены
  синхронно на RX. Это может быть использовано для управления периферийными устройствами, имеющими регистры сдвига
  (например, драйверами LCD). Фаза и полярность программируются программно. В режиме смарт карты CK может обеспечивать
  синхронизацию с смарт картами.

  В режиме аппаратного управления потоком требуются следующие контакты:
  - CTS: (Clear To Send) Блокирует передачу данных в конце текущей передачи при высоком уровне
  - RTS: (Request to send)Запрос на отправку укащывает, что USART готов к приему данных (при низком уровне)

