Solderingironspb/STM32F103C8T6_CMSIS_notes/CMSIS_SPI_Slave/Core/Src/stm32f103xx_CMSIS.c
  27.3.1 USART character description(Страница 790)

  Длина слова может быть выбрана равной 8 или 9 битам путем программирования бита М в регистре USART_CR1.
  Вывод TX находится в низком состоянии во время стартового бита и находится в высоком состоянии во время стопового бита.

  Свободная линия интерпретируется, как целый кадр из "1", за которым следует стартовый бит следующего кадра, содержащего
  данные (количество "1" включает количество стоповых битов).

  Разбитие кадра интерпретируется при получении "0" за весь период кадра. В конце кадра передатчик выставляет 1 или 2
  стоповых бита(логическая "1") для подтверждения стартового бита.

  Передача и прием управляются общим генератором baud rate. (Скорость приема и передачи будет одна)

  27.3.2 Transmitter(Страница 791)
  Передатчик может отправлять слова данных длиной 8 или 9 бит, в зависимости от состояния бита M.
  Когда бит разрешения передачи (TE) установлен, данные в сдвиговом регистре передачи выводятся на вывод TX,
  а соответствующие тактовые импульсы выводятся на вывод CK.

  Передача байта
  Во время передачи данные смещаются первым младшим значащим битом на выводе TX. В Этом режиме регистр USART_DR
  состоит из буфера (TDR) между внутренней шиной и сдвиговым регистром передачи.
  Каждому символу предшествует стартовый бит, который представляет собой низкий логический уровень в течение одного
  битового периода. Символ завершается конфигурируемым количеством стоповых битов.
  Стоповые биты 0.5, 1, 1.5, или 2.

  Внимание!
  Бит TE не должен сбрасываться во время передачи данных. Сброс бита TE во время передачи данных приведет к
  повреждению данных на выводе TX, поскольку счетчики скорости передачи зависнут.
  Текущие передаваемые данные будут потеряны.
  Пустой кадр будет отправлен после включения бита ТЕ.
  */

struct USART_name husart1; //Объявляем структуру по USART.(см. stm32f103xx_CMSIS.h)
struct USART_name husart2; //Объявляем структуру по USART.(см. stm32f103xx_CMSIS.h)


/**
 ******************************************************************************
 *  @breif Настройка USART1. Параметры 9600 8 N 1
 ******************************************************************************
 */

void CMSIS_USART1_Init(void) {

	SET_BIT(RCC->APB2ENR, RCC_APB2ENR_IOPAEN); //Включение тактирование порта А
	SET_BIT(RCC->APB2ENR, RCC_APB2ENR_AFIOEN); //Включение альтернативных функций

	//Для конфигурирование ножек UART для Full Duplex нужно использовать Alternate function push-pull(См. п.п. 9.1.11 GPIO configurations for device peripherals стр.111 Reference Manual)
	//Tx - Alternative Function output Push-pull(Maximum output speed 50 MHz)
	MODIFY_REG(GPIOA->CRH, GPIO_CRH_CNF9_Msk, 0b10 << GPIO_CRH_CNF9_Pos);
	MODIFY_REG(GPIOA->CRH, GPIO_CRH_MODE9_Msk, 0b11 << GPIO_CRH_MODE9_Pos);
	//Rx - Input floating
	MODIFY_REG(GPIOA->CRH, GPIO_CRH_CNF10_Msk, 0b1 << GPIO_CRH_CNF10_Pos);
	MODIFY_REG(GPIOA->CRH, GPIO_CRH_MODE10_Msk, 0b00 << GPIO_CRH_MODE10_Pos);

	//Запустим тактирование USART1
	SET_BIT(RCC->APB2ENR, RCC_APB2ENR_USART1EN);

	/*Расчет Fractional baud rate generation
	есть формула:
	Tx/Rx baud = fCK/(16*USARTDIV)
	где fCK - Input clock to the peripheral (PCLK1 for USART2, 3, 4, 5 or PCLK2 for USART1)
	в нашем случае fCK = 72000000
	допустим нам нужна скорость 9600
	9600 = 72000000/(16*USARTDIV)

	Тогда USARTDIV = 72000000/9600*16 = 468.75
	DIV_Mantissa в данном случае будет 468, что есть 0x1D4
	DIV_Fraction будет, как 0.75*16 = 12, что есть 0xC

	Тогда весь регистр USART->BRR для скорости 9600 будет выглядеть, как 0x1D4C.

	для примера еще разберем скорость 115200:
	115200 = 72000000/(16*USARTDIV)
	Тогда USARTDIV = 72000000/115200*16 = 39.0625
	DIV_Mantissa в данном случае будет 39, что есть 0x27
	DIV_Fraction будет, как 0.0625*16 = 1, что есть 0x1

	Тогда весь регистр USART->BRR для скорости 115200 будет выглядеть, как 0x271.

	*/

	MODIFY_REG(USART1->BRR, USART_BRR_DIV_Mantissa_Msk, 0x1D4 << USART_BRR_DIV_Mantissa_Pos);
	MODIFY_REG(USART1->BRR, USART_BRR_DIV_Fraction_Msk, 0xC << USART_BRR_DIV_Fraction_Pos);

	//27.6.4 Control register 1(USART_CR1)(см. стр 821 Reference Manual)
	SET_BIT(USART1->CR1, USART_CR1_UE); //USART enable
	CLEAR_BIT(USART1->CR1, USART_CR1_M); //Word lenght 1 Start bit, 8 Data bits, n Stop bit
	CLEAR_BIT(USART1->CR1, USART_CR1_WAKE); //Wake up idle Line
	CLEAR_BIT(USART1->CR1, USART_CR1_PCE); //Partity control disabled
	//настройка прерываний
	CLEAR_BIT(USART1->CR1, USART_CR1_PEIE); //partity error interrupt disabled
	CLEAR_BIT(USART1->CR1, USART_CR1_TXEIE); //TXE interrupt is inhibited
	CLEAR_BIT(USART1->CR1, USART_CR1_TCIE); //Transmission complete interrupt disabled
	SET_BIT(USART1->CR1, USART_CR1_RXNEIE); //Прерывание по приему данных включено
	SET_BIT(USART1->CR1, USART_CR1_IDLEIE); //Прерывание по флагу IDLE включено
	SET_BIT(USART1->CR1, USART_CR1_TE); //Transmitter is enabled
	SET_BIT(USART1->CR1, USART_CR1_RE); //Receiver is enabled and begins searching for a start bit
	CLEAR_BIT(USART1->CR1, USART_CR1_RWU);
	CLEAR_BIT(USART1->CR1, USART_CR1_SBK);

	//Остальную настройку, не касающуюся стандартного USART, мы пока трогать не будем, но на всякий случай обнулим
	USART1->CR2 = 0;
	CLEAR_BIT(USART1->CR2, USART_CR2_STOP); //1 стоп бит.
	USART1->CR3 = 0;
	USART1->GTPR = 0;

	NVIC_EnableIRQ(USART1_IRQn); //Включим прерывания по USART1
}

/**
 ******************************************************************************
 *  @breif Настройка USART2. Параметры 9600 8 N 1
 ******************************************************************************
 */

void CMSIS_USART2_Init(void) {

	SET_BIT(RCC->APB2ENR, RCC_APB2ENR_IOPAEN); //Включение тактирование порта А
	SET_BIT(RCC->APB2ENR, RCC_APB2ENR_AFIOEN); //Включение альтернативных функций

	//Для конфигурирование ножек UART для Full Duplex нужно использовать Alternate function push-pull(См. п.п. 9.1.11 GPIO configurations for device peripherals стр.111 Reference Manual)
	//Tx - Alternative Function output Push-pull(Maximum output speed 50 MHz)
	MODIFY_REG(GPIOA->CRL, GPIO_CRL_CNF2_Msk, 0b10 << GPIO_CRL_CNF2_Pos);
	MODIFY_REG(GPIOA->CRL, GPIO_CRL_MODE2_Msk, 0b11 << GPIO_CRL_MODE2_Pos);
	//Rx - Input floating
	MODIFY_REG(GPIOA->CRL, GPIO_CRL_CNF3_Msk, 0b1 << GPIO_CRL_CNF3_Pos);
	MODIFY_REG(GPIOA->CRL, GPIO_CRL_MODE3_Msk, 0b00 << GPIO_CRL_MODE3_Pos);

	//Запустим тактирование USART2
	SET_BIT(RCC->APB1ENR, RCC_APB1ENR_USART2EN);

	/*Расчет Fractional baud rate generation
	есть формула:
	Tx/Rx baud = fCK/(16*USARTDIV)
	где fCK - Input clock to the peripheral (PCLK1 for USART2, 3, 4, 5 or PCLK2 for USART1)
	в нашем случае fCK = 36000000
	допустим нам нужна скорость 9600
	9600 = 36000000/(16*USARTDIV)

	Тогда USARTDIV = 36000000/9600*16 = 234.375
	DIV_Mantissa в данном случае будет 234, что есть 0xEA
	DIV_Fraction будет, как 0.375*16 = 6, что есть 0x6

	Тогда весь регистр USART->BRR для скорости 9600 будет выглядеть, как 0xEA6.

