Solderingironspb/STM32F103C8T6_CMSIS_notes/CMSIS_SPI_Slave/Core/Src/stm32f103xx_CMSIS.c
	для примера еще разберем скорость 115200: (Неточность по скорости будет 0.15%. Не рекомендуется)
	115200 = 36000000/(16*USARTDIV)
	Тогда USARTDIV = 36000000/115200*16 = 19.53125
	DIV_Mantissa в данном случае будет 19, что есть 0x13
	DIV_Fraction будет, как 0.53125*16 = 8, что есть 0x8

	Тогда весь регистр USART->BRR для скорости 115200 будет выглядеть, как 0x138.

	*/

	MODIFY_REG(USART2->BRR, USART_BRR_DIV_Mantissa_Msk, 0xEA << USART_BRR_DIV_Mantissa_Pos);
	MODIFY_REG(USART2->BRR, USART_BRR_DIV_Fraction_Msk, 0x6 << USART_BRR_DIV_Fraction_Pos);

	//27.6.4 Control register 1(USART_CR1)(см. стр 821 Reference Manual)
	SET_BIT(USART2->CR1, USART_CR1_UE); //USART enable
	CLEAR_BIT(USART2->CR1, USART_CR1_M); //Word lenght 1 Start bit, 8 Data bits, n Stop bit
	CLEAR_BIT(USART2->CR1, USART_CR1_WAKE); //Wake up idle Line
	CLEAR_BIT(USART2->CR1, USART_CR1_PCE); //Partity control disabled
	//настройка прерываний
	CLEAR_BIT(USART2->CR1, USART_CR1_PEIE); //partity error interrupt disabled
	CLEAR_BIT(USART2->CR1, USART_CR1_TXEIE); //TXE interrupt is inhibited
	CLEAR_BIT(USART2->CR1, USART_CR1_TCIE); //Transmission complete interrupt disabled
	SET_BIT(USART2->CR1, USART_CR1_RXNEIE); //Прерывание по приему данных включено
	SET_BIT(USART2->CR1, USART_CR1_IDLEIE); //Прерывание по флагу IDLE включено
	SET_BIT(USART2->CR1, USART_CR1_TE); //Transmitter is enabled
	SET_BIT(USART2->CR1, USART_CR1_RE); //Receiver is enabled and begins searching for a start bit
	CLEAR_BIT(USART2->CR1, USART_CR1_RWU);
	CLEAR_BIT(USART2->CR1, USART_CR1_SBK);

	//Остальную настройку, не касающуюся стандартного USART, мы пока трогать не будем, но на всякий случай обнулим
	USART2->CR2 = 0;
	CLEAR_BIT(USART2->CR2, USART_CR2_STOP); //1 стоп бит.
	USART2->CR3 = 0;
	USART2->GTPR = 0;

	NVIC_EnableIRQ(USART2_IRQn); //Включим прерывания по USART2
}

/**
 ******************************************************************************
 *  @breif Прерывание по USART1
 ******************************************************************************
 */

__WEAK void USART1_IRQHandler(void) {
	if (READ_BIT(USART1->SR, USART_SR_RXNE)) {
		//Если пришли данные по USART
		husart1.rx_buffer[husart1.rx_counter] = USART1->DR; //Считаем данные в соответствующую ячейку в rx_buffer
		husart1.rx_counter++; //Увеличим счетчик принятых байт на 1
	}
	if (READ_BIT(USART1->SR, USART_SR_IDLE)) {
		//Если прилетел флаг IDLE
		USART1->DR; //Сбросим флаг IDLE
		husart1.rx_len = husart1.rx_counter; //Узнаем, сколько байт получили
		husart1.rx_counter = 0; //сбросим счетчик приходящих данных
	}
}


__WEAK void USART2_IRQHandler(void) {
	if (READ_BIT(USART2->SR, USART_SR_RXNE)) {
		//Если пришли данные по USART
		husart2.rx_buffer[husart2.rx_counter] = USART2->DR; //Считаем данные в соответствующую ячейку в rx_buffer
		husart2.rx_counter++; //Увеличим счетчик принятых байт на 1
	}
	if (READ_BIT(USART2->SR, USART_SR_IDLE)) {
		//Если прилетел флаг IDLE
		USART2->DR; //Сбросим флаг IDLE
		husart2.rx_len = husart2.rx_counter; //Узнаем, сколько байт получили
		husart2.rx_counter = 0; //сбросим счетчик приходящих данных
	}
}


/**
 ******************************************************************************
 *  @breif Функция отправки данных по USART
 *  @param  *USART - USART, с которого будут отправляться данные
 *  @param  *data - данные, которые будем отправлять
 *  @param  Size - сколько байт требуется передать
 ******************************************************************************
 */

bool CMSIS_USART_Transmit(USART_TypeDef* USART, uint8_t* data, uint16_t Size, uint32_t Timeout_ms) {
	for (uint16_t i = 0; i < Size; i++) {
		Timeout_counter_ms = Timeout_ms;
		//Ждем, пока линия не освободится
		while (READ_BIT(USART->SR, USART_SR_TXE) == 0) {
			if (!Timeout_counter_ms) {
				return false;
			}
		}
		USART->DR = *data++; //Кидаем данные  
	}
	return true;
}



/*================================= НАСТРОЙКА I2C ============================================*/

/**
***************************************************************************************
*  @breif Inter-integrated circuit (I2C) interface
*  Reference Manual/см. п.26 Inter-integrated circuit (I2C) interface (стр. 752)
***************************************************************************************
*/

/*Функциональное описание*/
/*
 * Помимо приема и передачи данных, этот интерфейс преобразует из последовательного формата
 * в параллельный и наоборот. Прерывания включаются или отключаются программно.
 * Интерфейс имеет вывод данных (SDA) и вывод синхронизации (SCL)
 * Его можно подключить с стандартной скоростью до 100 кГц или FastMode (до 400 кГц).
 */

 /*Выбор режима*/
 /*
  Интерфейс может работать в одном из четырех режимов:
	- Slave transmitter
	- Slave receiver
	- Master transmitter
	- Master receiver

 По-умолчанию он работает в slave режиме. Интерфейм автоматически переключается с slave на
 master после того, как он сгенерирует условие START, и с master на slave, если происходит потеря
 арбитража или генерация STOP, что обеспечивает возможность работы в резиме мультимастера.
 */


 /*Коммуникационный поток*/
 /*
  * В режиме Master интерфейс I2C инициирует передачу данных и генерирует тактовый сигнал.
  * A последовательная передача данных всегда начинается с условия "старт" и заканчивается условием "стоп".
  * В режиме ведущего устройства условия старта и останова генерируются программно.
  * В режиме Slave интерфейс способен распознавать свои собственные адреса (7 или 10-битные), а также
  * адрес общего вызова. Распознавание адреса общего вызова может быть включено или отключено программным путем.
  * Данные и адреса передаются в виде 8-битных байтов, MSB первым.
  * Первый байт(ы) содержат адрес (один в 7-битном режиме, два в 10-битном режиме).
  * Адрес всегда передается в режиме ведущего устройства.
  * За 8 тактами передачи байта следует 9-й тактовый импульс, в течение которого приемник должен передать передатчику бит подтверждения
 */

 /*Регистры(См. ReferenceManual стр. 772)*/

void CMSIS_I2C_Reset(void) {
	//Сброс настроек I2C
	//п.п. 26.6.1 I2C Control register 1 (I2C_CR1) (стр. 772)
	SET_BIT(I2C1->CR1, I2C_CR1_SWRST); //: I2C Peripheral not under reset
	while (READ_BIT(I2C1->CR1, I2C_CR1_SWRST) == 0);
	CLEAR_BIT(I2C1->CR1, I2C_CR1_SWRST); //: I2C Peripheral not under reset
	while (READ_BIT(I2C1->CR1, I2C_CR1_SWRST));
	/* Примечание: Этот бит можно использовать для повторной инициализации
	 * периферийного устройства после ошибки или заблокированного состояния.
	 * Например, если бит BUSY установлен и остается заблокированным из-за сбоя на шине,
	 * бит SWRST можно использовать для выхода из этого состояния.*/
}

/**
 *************************************************************************************
 *  @breif Функция инициализации шины I2C1. Sm.
 *************************************************************************************
 */

void CMSIS_I2C1_Init(void) {
	//Настройки тактирования
	SET_BIT(RCC->APB2ENR, RCC_APB2ENR_IOPBEN); //Запуск тактирование порта B
	SET_BIT(RCC->APB2ENR, RCC_APB2ENR_AFIOEN); //Запуск тактирования альтернативных функций
	SET_BIT(RCC->APB1ENR, RCC_APB1ENR_I2C1EN); //Запуск тактирования I2C1

	//Настройки ножек SDA и SCL
	//PB7 SDA (I2C Data I/O) Alternate function open drain
	MODIFY_REG(GPIOB->CRL, GPIO_CRL_CNF7_Msk, 0b11 << GPIO_CRL_CNF7_Pos); //Alternate function open drain
	MODIFY_REG(GPIOB->CRL, GPIO_CRL_MODE7_Msk, 0b11 << GPIO_CRL_MODE7_Pos); //Maximum output speed 50 MHz
	//PB6 SCL (I2C clock) Alternate function open drain
	MODIFY_REG(GPIOB->CRL, GPIO_CRL_CNF6_Msk, 0b11 << GPIO_CRL_CNF6_Pos); //Alternate function open drain
	MODIFY_REG(GPIOB->CRL, GPIO_CRL_MODE6_Msk, 0b11 << GPIO_CRL_MODE6_Pos); //Maximum output speed 50 MHz

	//26.6 I2C registers( См. Reference Manual стр. 772)

	//п.п. 26.6.1 I2C Control register 1 (I2C_CR1) (стр. 772)
	CMSIS_I2C_Reset();

	/*Это все для инита не нужно. После сброса итак будет в 0. */
	CLEAR_BIT(I2C1->CR1, I2C_CR1_ALERT); //Releases SMBA pin high.Alert Response Address Header followed by NACK
	CLEAR_BIT(I2C1->CR1, I2C_CR1_PEC); //No PEC transfer
	CLEAR_BIT(I2C1->CR1, I2C_CR1_POS); //ACK bit controls the (N)ACK of the current byte being received in the shift register
	CLEAR_BIT(I2C1->CR1, I2C_CR1_ACK); //No acknowledge returned
	CLEAR_BIT(I2C1->CR1, I2C_CR1_STOP); //No Stop generation
	CLEAR_BIT(I2C1->CR1, I2C_CR1_START); //No Start generation
	CLEAR_BIT(I2C1->CR1, I2C_CR1_NOSTRETCH); //Clock stretching enabled
	CLEAR_BIT(I2C1->CR1, I2C_CR1_ENGC); //General call disabled. Address 00h is NACKed.
	CLEAR_BIT(I2C1->CR1, I2C_CR1_ENPEC); //PEC calculation disabled
	CLEAR_BIT(I2C1->CR1, I2C_CR1_ENARP); //ARP disable
	CLEAR_BIT(I2C1->CR1, I2C_CR1_SMBTYPE); //SMBus Device
	CLEAR_BIT(I2C1->CR1, I2C_CR1_SMBUS); //I2C mode

	//п.п. 26.6.2 I2C Control register 2(I2C_CR2)(стр.774)
	CLEAR_BIT(I2C1->CR2, I2C_CR2_LAST); //Next DMA EOT is not the last transfer
	CLEAR_BIT(I2C1->CR2, I2C_CR2_DMAEN); //DMA requests disabled
	CLEAR_BIT(I2C1->CR2, I2C_CR2_ITBUFEN); //TxE = 1 or RxNE = 1 does not generate any interrupt.
	CLEAR_BIT(I2C1->CR2, I2C_CR2_ITEVTEN); //Event interrupt disabled
	CLEAR_BIT(I2C1->CR2, I2C_CR2_ITERREN); //Error interrupt disabled
	MODIFY_REG(I2C1->CR2, I2C_CR2_FREQ_Msk, 36 << I2C_CR2_FREQ_Pos); //f PCLK1 = 36 Мгц

	//п.п. 26.6.3 I2C Own address register 1(I2C_OAR1)(стр.776)
	I2C1->OAR1 = 0;
	//п.п. 26.6.4 I2C Own address register 1(I2C_OAR2)(стр.776)
	I2C1->OAR2 = 0;

