Solderingironspb/STM32F103C8T6_CMSIS_notes/CMSIS_SPI_Slave/Core/Src/stm32f103xx_CMSIS.c
	}
	if (READ_BIT(I2C->SR1, I2C_SR1_ADDR)) {
		//Если устройство отозвалось, сбросим бит ADDR
		/*Сброс бита ADDR производится чтением SR1, а потом SR2*/
		I2C->SR1;
		I2C->SR2;

		/*Отправим адрес памяти*/
		for (uint16_t i = 0; i < Size_adress; i++) {
			I2C->DR = *((uint8_t*)&Adress_data + (Size_adress - 1 - i)); //Запись байта
			while (READ_BIT(I2C->SR1, I2C_SR1_TXE) == 0) {
				//Ждем, пока данные загрузятся в регистр сдвига.

				if ((READ_BIT(I2C->SR1, I2C_SR1_AF) == 1)) {
					//Если устройство не отозвалось, прилетит 1 в I2C_SR1_AF 
					SET_BIT(I2C->CR1, I2C_CR1_STOP); //Останавливаем
					CLEAR_BIT(I2C->SR1, I2C_SR1_AF); //Сбрасываем бит AF
					return false;
				}
			}
		}

		/*Будем записывать данные в ячейку памяти, начиная с указанного адреса*/
		for (uint16_t i = 0; i < Size_data; i++) {
			I2C->DR = *(data + i); //Запись байта
			while (READ_BIT(I2C->SR1, I2C_SR1_TXE) == 0) {
				//Ждем, пока данные загрузятся в регистр сдвига.

				if ((READ_BIT(I2C->SR1, I2C_SR1_AF) == 1)) {
					//Если устройство не отозвалось, прилетит 1 в I2C_SR1_AF 
					SET_BIT(I2C->CR1, I2C_CR1_STOP); //Останавливаем
					CLEAR_BIT(I2C->SR1, I2C_SR1_AF); //Сбрасываем бит AF
					return false;
				}
			}
		}

		SET_BIT(I2C->CR1, I2C_CR1_STOP); //Останавливаем

		return true;

	}
	else {
		//Если устройство не отозвалось, прилетит 1 в I2C_SR1_AF 
		SET_BIT(I2C->CR1, I2C_CR1_STOP); //Останавливаем
		CLEAR_BIT(I2C->SR1, I2C_SR1_AF); //Сбрасываем бит AF

		return false;
	}
}


/**
 **************************************************************************************************
 *  @breif Функция чтения из памяти по указанному адресу
 *  @param  *I2C - шина I2C
 *  @param  Adress_Device - Адрес устройства
 *  @param  Adress_data - Адрес в памяти, откуда будем считывать данные
 *  @param  Size_adress - Размер адреса в байтах. Пример: 1 - 8 битный адрес. 2 - 16 битный адрес.
 *  @param  *data - Данные, в которые будем записывать считанную информацию.
 *  @param  Size_data - Размер, сколько байт будем считывать.
 *  @retval  Возвращает статус считывания. True - Успешно. False - Ошибка.
 **************************************************************************************************
 */
bool CMSIS_I2C_MemRead(I2C_TypeDef* I2C, uint8_t Adress_Device, uint16_t Adress_data, uint8_t Size_adress, uint8_t* data, uint16_t Size_data, uint32_t Timeout_ms) {

	/*-------------------Проверка занятости шины-------------------*/
	if (READ_BIT(I2C->SR2, I2C_SR2_BUSY)) {
		//Если шина занята

		if ((READ_BIT(GPIOB->IDR, GPIO_IDR_IDR6)) && (READ_BIT(GPIOB->IDR, GPIO_IDR_IDR7))) {
			//Если линия на самом деле свободна, а BUSY висит
			CMSIS_I2C_Reset(); //ресет
			CMSIS_I2C1_Init(); //повторная инициализация
		}

		if (READ_BIT(I2C->SR2, I2C_SR2_MSL)) {
			//Если стоит статус, что мы в мастере
			SET_BIT(I2C->CR1, I2C_CR1_STOP); //Отправим сигнал STOP
		}

		if (I2C->CR1 != 1) {
			//Если в CR1 что-то лишнее, то перезагрузим I2C
			CLEAR_BIT(I2C->CR1, I2C_CR1_PE);
			SET_BIT(I2C->CR1, I2C_CR1_PE);
		}

		return false;
	}
	/*-------------------Проверка занятости шины-------------------*/

	CLEAR_BIT(I2C->CR1, I2C_CR1_POS); //Бит ACK управляет (N)ACK текущего байта, принимаемого в сдвиговом регистре.
	SET_BIT(I2C->CR1, I2C_CR1_START); //Стартуем.

	Timeout_counter_ms = Timeout_ms;
	while (READ_BIT(I2C->SR1, I2C_SR1_SB) == 0) {
		//Ожидаем до момента, пока не сработает Start condition generated

		if (!Timeout_counter_ms) {
			return false;
		}

	}
	//ВНИМАНИЕ!
	/* Бит I2C_SR1_SB очищается программно путем чтения регистра SR1 с последующей записью в регистр DR или когда PE=0*/
	I2C->SR1;
	I2C->DR = (Adress_Device << 1); //Адрес + команда Write

	Timeout_counter_ms = Timeout_ms;
	while ((READ_BIT(I2C->SR1, I2C_SR1_AF) == 0) && (READ_BIT(I2C->SR1, I2C_SR1_ADDR) == 0)) {
		//Ждем, пока адрес отзовется

		if (!Timeout_counter_ms) {
			return false;
		}

	}

	if (READ_BIT(I2C->SR1, I2C_SR1_ADDR)) {
		//Если устройство отозвалось, сбросим бит ADDR
		/*Сброс бита ADDR производится чтением SR1, а потом SR2*/
		I2C->SR1;
		I2C->SR2;

		/*Отправим адрес памяти*/
		for (uint16_t i = 0; i < Size_adress; i++) {
			I2C->DR = *((uint8_t*)&Adress_data + (Size_adress - 1 - i)); //Запись байта
			while (READ_BIT(I2C->SR1, I2C_SR1_TXE) == 0) {
				//Ждем, пока данные загрузятся в регистр сдвига.

				if ((READ_BIT(I2C->SR1, I2C_SR1_AF) == 1)) {
					//Если устройство не отозвалось, прилетит 1 в I2C_SR1_AF 
					SET_BIT(I2C->CR1, I2C_CR1_STOP); //Останавливаем
					CLEAR_BIT(I2C->SR1, I2C_SR1_AF); //Сбрасываем бит AF
					return false;
				}
			}
		}

		//Повторный старт
		SET_BIT(I2C->CR1, I2C_CR1_START); //Стартуем.

		Timeout_counter_ms = Timeout_ms;
		while (READ_BIT(I2C->SR1, I2C_SR1_SB) == 0) {
			//Ожидаем до момента, пока не сработает Start condition generated

			if (!Timeout_counter_ms) {
				return false;
			}

		}
		//ВНИМАНИЕ!
		/* Бит I2C_SR1_SB очищается программно путем чтения регистра SR1 с последующей записью в регистр DR или когда PE=0*/
		I2C->SR1;
		I2C->DR = (Adress_Device << 1 | 1); //Адрес + команда Read

		Timeout_counter_ms = Timeout_ms;
		while ((READ_BIT(I2C->SR1, I2C_SR1_AF) == 0) && (READ_BIT(I2C->SR1, I2C_SR1_ADDR) == 0)) {
			//Ждем, пока адрес отзовется

			if (!Timeout_counter_ms) {
				return false;
			}

		}

		if (READ_BIT(I2C->SR1, I2C_SR1_ADDR)) {
			//Если устройство отозвалось, сбросим бит ADDR
			/*Сброс бита ADDR производится чтением SR1, а потом SR2*/
			I2C->SR1;
			I2C->SR2;

			/*Прочтем данные, начиная с указанного адреса*/
			for (uint16_t i = 0; i < Size_data; i++) {
				if (i < Size_data - 1) {
					SET_BIT(I2C->CR1, I2C_CR1_ACK); //Если мы хотим принять следующий байт, то отправляем ACK 
					while (READ_BIT(I2C->SR1, I2C_SR1_RXNE) == 0);
					*(data + i) = I2C->DR; //Чтение байта
				}
				else {
					CLEAR_BIT(I2C->CR1, I2C_CR1_ACK); //Если мы знаем, что следующий принятый байт будет последним, то отправим NACK

					SET_BIT(I2C->CR1, I2C_CR1_STOP); //Останавливаем
					while (READ_BIT(I2C->SR1, I2C_SR1_RXNE) == 0); //Подождем, пока сдвиговый регистр пополнится новым байтом данных
					*(data + i) = I2C->DR; //Чтение байта
				}
			} return true;

