Solderingironspb/STM32F103C8T6_CMSIS_notes/CMSIS_SPI_Slave/Core/Src/stm32f103xx_CMSIS.c
		}
		else {
			//Если устройство не отозвалось, прилетит 1 в I2C_SR1_AF 
			SET_BIT(I2C->CR1, I2C_CR1_STOP); //Останавливаем
			CLEAR_BIT(I2C->SR1, I2C_SR1_AF); //Сбрасываем бит AF
			return false;
		}

	}
	else {
		//Если устройство не отозвалось, прилетит 1 в I2C_SR1_AF 
		SET_BIT(I2C->CR1, I2C_CR1_STOP); //Останавливаем
		CLEAR_BIT(I2C->SR1, I2C_SR1_AF); //Сбрасываем бит AF
		return false;
	}
}


/*================================= НАСТРОЙКА SPI ============================================*/

/**
***************************************************************************************
*  @breif Serial peripheral interface (SPI)
*  Reference Manual/см. п.25 Serial peripheral interface (SPI) (стр. 699)
***************************************************************************************
*/

/*Функциональное описание*/
/*
 * Обеспечивает полудуплексную, синхронную, последовательную связь с внешними устройствами.
 * Интерфейс может быть сконфигурирован, как ведущий, и в этом случае он обеспечивает
 * синхронизацию связи SCK с внешним ведомым устройством. Интерфейс также может работать
 * в конфигурации с несколькими мастерами.
 */

 /*Функции:*/
 /*
  * - Полный дюплекс и синхронная передача по трем ляниям
  * - Симплексная синхронная передача по двум линиям с двунаправленной линией данных или без нее
  * - Выбор формата 8 или 16 битного кадра передачи
  * - Работа в режиме Master и Slave
  * - Возможность работы в режиме Multimaster
  * - 8 предварительных делителей скорости передачи данных в ведущем режиме (fPCLK/2 max)
  * - Частота слейв мода (fPCLK/2 max)
  * - Более быстрая связь, как для мастера, так и для слейва(что?)
  * - Управление NSS с помощью аппаратного или программного обеспечения, как для ведущего,
  *   так и для ведомого: динамическая смена операция ведущего/ведомого
  * - Программируемая полярность и фаза (Polarity and phase)
  * - Программируемый порядок данных со свигом в сторону старших или младших разрядов
  * - Специальные флаги передачи и приема с возможностью прерывания.
  * - Флаг состояния занятости шины SPI
  * - Аппаратный CRC:
  *   - значение CRC может быть передано, как последний байт в режиме Tx
  *   - автоматическая проверка ошибок CRC для последнего полученного байта
  * - Флаги неисправности, переполнения и ошибок CRC в ведущем режиме, с возможностью прерывания.
  * - 1 байтовый буфер передачи и приема с возможностью DMA: запросы Tx и Rx.
 */

 /*SPI interrupts (см. п.п. 25.3.11 стр.722)*/
 /*---------------------SPI interrupt requests-------------------------*/
 /*______________________________________________________________________________
   |______Interrupt event________|_______Event flag______|___Enable Control bit__|
   |Transmit buffer empty flag   |          TXE          |          TXEIE        |
   |Receive buffer not empty flag|          RXNE         |__________RXNEIE_______|
   |Master Mode fault event      |          MODF         |                       |
   |Overrun error                |          OVR          |          ERRIE        |
   |CRC error flag_______________|__________CRCERR_______|_______________________|

   */

   /*----SPI and I2S registers(см п.п. 25.5  стр 742)-------*/

void CMSIS_SPI1_init(void) {
	/*Настройка GPIO*/
	SET_BIT(RCC->APB2ENR, RCC_APB2ENR_AFIOEN); //Включение альтернативных функций
	SET_BIT(RCC->APB2ENR, RCC_APB2ENR_SPI1EN); //Включение тактирования SPI1
	SET_BIT(RCC->APB2ENR, RCC_APB2ENR_IOPAEN); //Включение тактирования порта А
	/*Какие ножки:*/
	//PA4 - NSS
	//PA5 - SCK
	//PA6 - MISO
	//PA7 - MOSI
	
	//SPI в режим Master
	/*
	 * SPIx_SCK  Master - Alternate function push-pull
	 * SPIx_MOSI:
	 *             Full duplex / master - Alternate function push-pull
	 *             Simplex bidirectional data wire / master - Alternate function push-pull
	 * SPIx_MISO:
	 *             Full duplex / master - Input floating / Input pull-up
	 *
	 * SPIx_NSS:
	 *             Hardware master /slave - Input floating/ Input pull-up / Input pull-down
	 *             Hardware master/ NSS output enabled - Alternate function push-pull
	 *             Software - Not used. Can be used as a GPIO
	 */
	
	//SPI в режим Slave
	/*
	 * SPIx_SCK  Slave - Input floating
	 * SPIx_MOSI:
	 *             Full duplex / slave - Input floating/input pull-up
	 * SPIx_MISO:
	 *             Full duplex / slave - Alternate function push-pull
	 *
	 * SPIx_NSS:
	 *             Hardware master /slave - Input floating/ Input pull-up / Input pull-down
	 *             Hardware master/ NSS output enabled - Alternate function push-pull
	 *             Software - Not used. Can be used as a GPIO
	 */
	
	//SCK - PA5:
	MODIFY_REG(GPIOA->CRL, GPIO_CRL_MODE5, 0b00 << GPIO_CRL_MODE5_Pos); //Input
	MODIFY_REG(GPIOA->CRL, GPIO_CRL_CNF5, 0b01 << GPIO_CRL_CNF5_Pos); //Input floating
	//MISO - PA6:
	MODIFY_REG(GPIOA->CRL, GPIO_CRL_MODE6, 0b11 << GPIO_CRL_MODE6_Pos); //Alternative Function output
	MODIFY_REG(GPIOA->CRL, GPIO_CRL_CNF6, 0b10 << GPIO_CRL_CNF6_Pos); //Push-pull
	//MOSI - PA7:
	MODIFY_REG(GPIOA->CRL, GPIO_CRL_MODE7, 0b00 << GPIO_CRL_MODE7_Pos); //Input
	MODIFY_REG(GPIOA->CRL, GPIO_CRL_CNF7, 0b01 << GPIO_CRL_CNF7_Pos); //Input floating

	 /*SPI control register 1 (SPI_CR1) (not used in I2S mode)(см. п.п. 25.5.1 стр 742)*/
	/*
	 * Bits 5:3 BR[2:0]: Baud rate control
	 * 000: fPCLK/2
	 * 001: fPCLK/4
	 * 010: fPCLK/8
	 * 011: fPCLK/16
	 * 100: fPCLK/32
	 * 101: fPCLK/64
	 * 110: fPCLK/128
	 * 111: fPCLK/256
	 * */
	CLEAR_BIT(SPI1->CR1, SPI_CR1_DFF); //0: 8-bit data frame format is selected for transmission/reception
	CLEAR_BIT(SPI1->CR1, SPI_CR1_CPOL); //Полярность 0
	CLEAR_BIT(SPI1->CR1, SPI_CR1_CPHA); //Фаза 0
	CLEAR_BIT(SPI1->CR1, SPI_CR1_LSBFIRST); //0: MSB transmitted first
	SET_BIT(SPI1->CR1, SPI_CR1_SSM); //1: Software slave management enabled
	CLEAR_BIT(SPI1->CR1, SPI_CR1_SSI); //0: Software slave management disabled
	CLEAR_BIT(SPI1->CR1, SPI_CR1_MSTR); //0: Slave configuration 
	CLEAR_BIT(SPI1->CR1, SPI_CR1_BIDIMODE); //0: 2-line unidirectional data mode selected
	CLEAR_BIT(SPI1->CR1, SPI_CR1_RXONLY); //0: full duplex

	

