Solderingironspb/STM32F103C8T6_CMSIS_notes/CMSIS_SPI_Slave/Core/Src/stm32f103xx_CMSIS.c
	CLEAR_BIT(SPI1->CR1, SPI_CR1_CRCEN); //0: CRC calculation disabled
	CLEAR_BIT(SPI1->CR1, SPI_CR1_CRCNEXT); // 0: Data phase (no CRC phase) 



	/*SPI control register 2 (SPI_CR2) (см. п.п. 25.5.2 стр 744)*/
	CLEAR_BIT(SPI1->CR2, SPI_CR2_RXDMAEN); //0: Rx buffer DMA disabled
	CLEAR_BIT(SPI1->CR2, SPI_CR2_TXDMAEN); //0: Tx buffer DMA disabled
	CLEAR_BIT(SPI1->CR2, SPI_CR2_SSOE); //0: SS output is disabled in master mode and the cell can work in multimaster configuration
	CLEAR_BIT(SPI1->CR2, SPI_CR2_ERRIE); //0: Error interrupt is masked
	SET_BIT(SPI1->CR2, SPI_CR2_RXNEIE); //0: RXNE interrupt masked 
	CLEAR_BIT(SPI1->CR2, SPI_CR2_TXEIE); //0: TXE interrupt masked 

	/*SPI_I2S configuration register (SPI_I2SCFGR) (см. п.п. 25.5.8 стр 748)*/
	CLEAR_BIT(SPI1->I2SCFGR, SPI_I2SCFGR_I2SMOD); //т.к. на F103C6T6 нет I2S, его вырезали, а регистр оставили, нужно просто обнулить данный регистр. Тем самым включим режим SPI mode.


	SET_BIT(SPI1->CR1, SPI_CR1_SPE); //Включим SPI
	NVIC_EnableIRQ(SPI1_IRQn); //Включим прерывания по spi1

}

/**
 **************************************************************************************************
 *  @breif Функция передачи данных по шине SPI
 *  @param  *SPI - шина SPI
 *  @param  *data - Данные, которые будем передавать.
 *  @param  Size_data - Размер, сколько байт будем передавать.
 *  @retval  Возвращает статус передачи. True - Успешно. False - Ошибка.
 **************************************************************************************************
 */
bool CMSIS_SPI_Data_Transmit_8BIT(SPI_TypeDef* SPI, uint8_t* data, uint16_t Size_data, uint32_t Timeout_ms) {
	//(см. Reference Manual стр. 712 Transmit-only procedure (BIDIMODE=0 RXONLY=0))
	if (!READ_BIT(SPI->SR, SPI_SR_BSY)) {
		//Проверим занятость шины
		SPI->DR = *(data); //Запишем первый элемент данных для отправки в регистр SPI_DR
		//(При этом очищается бит TXE)

		for (uint16_t i = 1; i < Size_data; i++) {
			Timeout_counter_ms = Timeout_ms;
			while (!READ_BIT(SPI->SR, SPI_SR_TXE)) {
				//Ждем, пока буфер на передачу не освободится
				if (!Timeout_counter_ms) {
					return false;
				}
			}
			SPI->DR = *(data + i); //Запишем следующий элемент данных.
		}
		Timeout_counter_ms = Timeout_ms;
		while (!READ_BIT(SPI->SR, SPI_SR_TXE)) {
			//После записи последнего элемента данных в регистр SPI_DR,
			//подождем, пока TXE станет равным 1.
			if (!Timeout_counter_ms) {
				return false;
			}
		}
		Timeout_counter_ms = Timeout_ms;
		while (READ_BIT(SPI->SR, SPI_SR_BSY)) {
			//Затем подождем, пока BSY станет равным 0.
			//Это указывает на то, что передача последних данных завершена.
			if (!Timeout_counter_ms) {
				return false;
			}
		}
		return true;
	}
	else {
		return false;
	}
	//Примечание:
	//После передачи двух элементов данных в режиме "transmit-only mode" в регистре SPI_SR устанавливается флаг OVR, так как принятые данные никогда не считываются.
}

/**
 **************************************************************************************************
 *  @breif Функция передачи данных по шине SPI
 *  @param  *SPI - шина SPI
 *  @param  *data - Данные, которые будем передавать.
 *  @param  Size_data - сколько 16 - битных данных хотим передать. Т.е. 1 = 2 байта.
 *  @retval  Возвращает статус передачи. True - Успешно. False - Ошибка.
 **************************************************************************************************
 */
bool CMSIS_SPI_Data_Transmit_16BIT(SPI_TypeDef* SPI, uint16_t* data, uint16_t Size_data, uint32_t Timeout_ms) {
	//(см. Reference Manual стр. 712 Transmit-only procedure (BIDIMODE=0 RXONLY=0))
	if (!READ_BIT(SPI->SR, SPI_SR_BSY)) {
		//Проверим занятость шины
		SPI->DR = *(data); //Запишем первый элемент данных для отправки в регистр SPI_DR
		//(При этом очищается бит TXE)

		for (uint16_t i = 1; i < Size_data; i++) {
			Timeout_counter_ms = Timeout_ms;
			while (!READ_BIT(SPI->SR, SPI_SR_TXE)) {
				//Ждем, пока буфер на передачу не освободится
				if (!Timeout_counter_ms) {
					return false;
				}
			}
			SPI->DR = *(data + i); //Запишем следующий элемент данных.
		}
		Timeout_counter_ms = Timeout_ms;
		while (!READ_BIT(SPI->SR, SPI_SR_TXE)) {
			//После записи последнего элемента данных в регистр SPI_DR,
			//подождем, пока TXE станет равным 1.
			if (!Timeout_counter_ms) {
				return false;
			}
		}
		Timeout_counter_ms = Timeout_ms;
		while (READ_BIT(SPI->SR, SPI_SR_BSY)) {
			//Затем подождем, пока BSY станет равным 0.
			//Это указывает на то, что передача последних данных завершена.
			if (!Timeout_counter_ms) {
				return false;
			}
		}
		return true;
	}
	else {
		return false;
	}
	//Примечание:
	//После передачи двух элементов данных в режиме "transmit-only mode" в регистре SPI_SR устанавливается флаг OVR, так как принятые данные никогда не считываются.
}

/**
 **************************************************************************************************
 *  @breif Функция приема данных по шине SPI
 *  @param  *SPI - шина SPI
 *  @param  *data - Данные, куда будем записывать принятые данные.
 *  @param  Size_data - Размер, сколько байт хотим принять.
 *  @retval  Возвращает статус приема. True - Успешно. False - Ошибка.
 **************************************************************************************************
 */
bool CMSIS_SPI_Data_Receive_8BIT(SPI_TypeDef* SPI, uint8_t* data, uint16_t Size_data, uint32_t Timeout_ms) {
	if (!READ_BIT(SPI->SR, SPI_SR_BSY)) {
		//Проверим занятость шины

		if (READ_BIT(SPI->SR, SPI_SR_OVR) || READ_BIT(SPI->SR, SPI_SR_RXNE)) {
			//Т.к. мы можем принимать данные в любой момент, например после режима "transmit-only mode"
			//то следует проверить статусы OVR и RXNE. Если хотя бы один из них установлен, 
			//то сбросим их при помощи чтения регистра DR.
			SPI->DR;
		}

		//Начнем прием данных
		for (uint16_t i = 0; i < Size_data; i++) {
			SPI->DR = 0; //Запустим тактирование, чтоб считать 8 бит
			Timeout_counter_ms = Timeout_ms;
			while (!READ_BIT(SPI->SR, SPI_SR_RXNE)) {
				//Ждем, пока буфер на прием не заполнится
				if (!Timeout_counter_ms) {
					return false;
				}
			}
			*(data + i) = SPI->DR; //Считываем данные
		}

		Timeout_counter_ms = Timeout_ms;
		while (READ_BIT(SPI->SR, SPI_SR_BSY)) {
			//Затем подождем, пока BSY станет равным 0.
			//Это указывает на то, что прием последних данных завершен.
			if (!Timeout_counter_ms) {
				return false;
			}
		}
		return true;
	}
	else {
		return false;
	}
}

/**
 **************************************************************************************************
 *  @breif Функция приема данных по шине SPI
 *  @param  *SPI - шина SPI
 *  @param  *data - Данные, куда будем записывать принятые данные.
 *  @param  Size_data - Размер, сколько 16 - битных данных хотим принять. Т.е. 1 = 2 байта.
 *  @retval  Возвращает статус приема. True - Успешно. False - Ошибка.
 **************************************************************************************************
 */
bool CMSIS_SPI_Data_Receive_16BIT(SPI_TypeDef* SPI, uint16_t* data, uint16_t Size_data, uint32_t Timeout_ms) {
	if (!READ_BIT(SPI->SR, SPI_SR_BSY)) {
		//Проверим занятость шины

		if (READ_BIT(SPI->SR, SPI_SR_OVR) || READ_BIT(SPI->SR, SPI_SR_RXNE)) {
			//Т.к. мы можем принимать данные в любой момент, например после режима "transmit-only mode"
			//то следует проверить статусы OVR и RXNE. Если хотя бы один из них установлен, 
			//то сбросим их при помощи чтения регистра DR.
			SPI->DR;
		}

		//Начнем прием данных
		for (uint16_t i = 0; i < Size_data; i++) {
			SPI->DR = 0; //Запустим тактирование, чтоб считать 16 бит
			Timeout_counter_ms = Timeout_ms;
			while (!READ_BIT(SPI->SR, SPI_SR_RXNE)) {
				//Ждем, пока буфер на прием не заполнится
				if (!Timeout_counter_ms) {
					return false;
				}
			}
			*(data + i) = SPI->DR; //Считываем данные
		}

		Timeout_counter_ms = Timeout_ms;
		while (READ_BIT(SPI->SR, SPI_SR_BSY)) {
			//Затем подождем, пока BSY станет равным 0.
			//Это указывает на то, что прием последних данных завершен.
			if (!Timeout_counter_ms) {
				return false;
			}
		}
		return true;
	}
	else {
		return false;
	}
}